#+TODO: TODO(t) NEXT | DONE(d!) DESISTIDO
#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2018-11-03 sáb 09:16]
| Headline               | Time   |      |
|------------------------+--------+------|
| *Total time*           | *7:29* |      |
|------------------------+--------+------|
| 2018                   | 7:29   |      |
| \_  2018-01 enero      |        | 0:03 |
| \_  2018-03 marzo      |        | 0:01 |
| \_  2018-09 septiembre |        | 0:04 |
| \_  2018-10 octubre    |        | 6:26 |
| \_  2018-11 noviembre  |        | 0:55 |
#+END:

* 2016
** 2016-10 octubre
*** 2016-10-22 sábado
**** minuta de programacion :programacion:
:LOGBOOK:
CLOCK: [2018-10-10 mié 18:29]--[2018-10-10 mié 18:29] =>  0:00
:END:
 orgfile de relato o minuta de todos los items que vamos trabajando
 durante el trabajo con clock. entonces cumple una funcion doble es una
 lista de todos los items programados y las fechas.
 me saca la duda o sensacion de que carajo hice cada dia, en especial
 ahora que dedico la mañana y a la vez cuanto me lleva programar.
 hacer chunks de estudio y visitar el diario de desarrollo estarian
 incluidos en la tarea de programar, pq estarian dentro del mismo tema.
 se diferencia del diario de desarrollo que en el se debate lo que se
 va a hacer, y este registra lo que se hace, muy claramente en vim.
 ver si el clockeado en subtree se suma arriba

* 2018 :2018:
** 2018-01 enero
*** 2018-01-10 miércoles
**** problema tiempo libre cambio horario a la manana :problemaTiempo:
:LOGBOOK:
CLOCK: [2018-10-15 lun 18:06]--[2018-10-15 lun 18:07] =>  0:01
:END:
  el problema de haber cambiado el horario es que no puedo pasarme el
 tiempo durmiendo excesivamente y luego pasar a ver netflix, y luego
 ir a dormir de nuevo. Tengo que hacer cosas productivas para
 justificar el cambio. Tampoco da por ahora la idea de salir, No estoy
 animicamente para eso. Por el momento creo que esta bueno que me
 inspire en hacer estas cosas que tengo que hacer y nunca hice.

*** 2018-01-11 jueves
**** experiencias luego de la lectura de Louse Hay :lecturas:estadoAnimico:RELEER:
:LOGBOOK:
CLOCK: [2018-10-15 lun 18:10]--[2018-10-15 lun 18:11] =>  0:01
:EN

***** "puedo cambiar" en medio del ejercicio

 en el capitulo de louise hay donde dice que el uso del espejo es
 fundamental para las afirmaciones en voz alta, pues es ahi donde
 veremos si creemos nosotros mismos en lo que supuestamente
 decimos. Esto retoma el famoso libro que lei en la decada del 80, que
 hablaba del metodo del espejo y yo no lo practique muy mucho. 
 Hoy hice la prueba con la afirmacion PUEDO CAMBIAR y no solo que pude
 hacerla con conviccion sino que en medio del ejercicio de tres series
 completo incluido el tercer ejercicio a rajatabla pude renovar fuerzas
 sin saber de donde salian y puedo decir que no hubiera completado
 nunca las tres series sin las afirmaciones.
 Y luego hice la primer serie de pushup.

***** sin la practica esos libros no sirven

 si no hacemos la practica no sirven.
 Es importante esa parte que dice que hay una necesidad dentro de
 nosotros para ser como somos sino atacamos esa causa no eliminaremos
 los efectos. Siempre estaremos solos, por miedo a la invasion en
 nuestras vidas de las otras personas y a la vez nunca cambiamos nunca
 hacemos nada en privado que sea realmente privado, o sea uno tiene
 miedo de perder esa privacidad que no aprovecha se podria decir
 (p.e. si vamos al caso de poder hacer gimnasia en mi caso, o de hacer
 un sistema de cambio por control mental por ejercicios que puedan
 parecer esotericos)
 Estuve pensando y no hice nada hoy que no hubiera podido hacer si
 hubiera estado en pareja, es mas hay cosas que me tienen eternamente
 trabado pq no estoy en pareja, como el mantenimiento del dpto (que no
 digo que me lo haga la pareja, pero mi parte seria mas facil hacerla
 si estuviera con otra persona) y la comida. 
 La escritura, la lectura, etc son temas privados que incluso siguen.
 Es una sensacion, como la sensacion de que hay quilombo en el dpto y
 nunca se termina de limpiar, o que hay muchas cosas por hacer y nunca
 se hacen. Parte pq se trabaja mal (p.e. el tema recibos y documentos
 esta mal y esta atorado pq se trabajo mal) 

 Igual el tema del dpto que hay muchisimas cosas que no se resuelven
 nunca en una minimalizacion que sea compatible con otras personas.
 Pero PUEDO CAMBIAR.

***** louise hay tiene la clave

 se que tiene la clave pq en las inseguridades propias y en la falta de
 amor por uno mismo esta la clave. Si uno no puede hablarse al espejo
 solo en su propia soledad imaginate si podra hablarle a los demas. Por
 eso pienso que debo continuar por ese camino.

*** 2018-01-13 sábado
**** Aplicacion de conceptos de Louse Hay :lecturas:
:LOGBOOK:
CLOCK: [2018-10-15 lun 18:19]--[2018-10-15 lun 18:20] =>  0:01
:END:

***** descubrimiento del poder de la mente :RELEER:

 me llama la atencion la idea de que "la mente es un instrumento que
 usted puede usar de cualquier manera como lo desee"
 "A medida que aprenda a controlar la mente eligiendo conscientemente
 sus pensamientos, ira ganandose como aliado ese poder"
 Y alli tengo dos ejemplos y un contraejemplo

****** Ejemplo oficina:

 Estaba tan mal que no queria ir mas a la oficina, me costaba
 levantarme y enfrentar otro dia de trabajo. Y leyendo un capitulo
 donde uno hacia un repaso mental de todos los lugares y cosas de la
 oficina e iba bendiciendolas a todas con el corazon, y cada una de las
 personas, incluso a la persona que en ese momento mas tenia cruzada
 que era CL la imaginaba que era eficiente y se comportaba en forma
 opuesta a lo que me molestaba, y la transformacion fue casi milagrosa
 y ha funcionado hasta el dia de hoy. Y solo cambio el pensamiento.

****** Ejemplo ejercicio:

 Luego de dos meses y medio de no hacer ejercicios, me encare a la idea
 de hacer las series de ejercicio con mucho esfuerzo pero en el medio
 de cada serie hacia una serie de afirmaciones en el espejo de "Puedo
 cambiar" y eso me dio energia suficiente para lograr las tres series
 completas y empezar los pushup, todo pienso que imposible sin ese
 aditamento.

****** Contraejemplo:

 el dia que fui al mercado norte y se me fueron los pensamientos en un
 espiral negativo cada vez peor y cuando llegue a casa a los cuarenta
 minutos tenia una migraña explosiva. Estoy seguro que si hubiera
 interrumpido el flujo de pensamientos y cambiado no habria pasado
 nada.

***** manejo del tiempo en el nuevo esquema horario

 por el momento tratando de transformar la realidad del dpto, como hice
 comenzando con la cocina, y pienso seguir con el tema documentos y el
 resto de las minimalizaciones.
 creo que mientras limite la duracion de la siesta para no interferir
 con la noche y solucionemos el problema de hacer con calor a la tarde
 total despues te das una ducha y listo se puede hacer un sistema de
 limpieza con poco esfuerzo o bien pasar la masa critica de  esfuerzo o
 de resultado que haga que luego sea agradable continuar y
 mantener. Igual con los minimos acomodos que hacen falta a nivel
 cables. 

***** entrenamiento mental

 creo que se puede comenzar un serio entrenamiento mental usando
 afirmaciones.
 he comenzado una dificil, muy dificil en mi caso apoyandome en un
 video y de ahi van surgiendo las trabas, como pq no quiero una
 relacion estable pq no quiero cosas que me aten o que puedan ponerme
 en estres, por eso las afirmaciones se van afinando bien precisamente
 a lo que quiero y son ayudadas con la visualidad.
 Recordando en tiempo presente, en positivo, con
 emocion. Reiteradamente. Antes de acostarme y al levantarme. Veremos
 cuanto tiempo demoramos en hacerlo realidad.

***** ejercicio con "ayuda mental"

 creo que lo demostre anteayer y el dolor muscular es prueba de que fue
 lo suficientemente intenso como para que sirviera. Ahora pienso que
 debo superar cierta "masa critica" para que empiece a crear musculo,
 eso va a costar mucho en mi caso. 
 Hace varios dias me da vuelta en la cabeza la pregunta Cuanto estarias
 dispuesto a dar para un resultado tan espectacular como ese cambio?,
 pq hacer un cambio para el cual ya estoy usando camisas mc sin
 camisetas abajo en solo dos meses solo por dieta, tendria que hacer un
 sacrificio.

***** rearmar el tema alimentario

 idem anterior es el tema dieta, felizmente hasta hoy me he mantenido
 dentro, salvo breves salidas que no llegan al 10% de lo permitido, con
 batata.
 Pero hay que reformar la dieta urgente para dar variedad.

** 2018-03 marzo
*** 2018-03-15 jueves
**** Louse Hey reflexiones sobre traumas infantiles :lecturas:
:LOGBOOK:
CLOCK: [2018-10-10 mié 18:50]--[2018-10-10 mié 18:51] =>  0:01
:END:

***** necesidad de pontificar u obtener lustre indirectamente

 o sea de hacerse odiar. O sea de resaltar cosas en las cuales siempre
 quedamos bien parados o mejor parados que los demas. O sea es una
 forma de busqueda de aprobacion externa que viene a ser buscada
 indirectamente.

***** necesidad de quejarse

 hay un articulo perfecto en el cuaderno donde describo el ideal que
 veria en ih si sirviera a proposito para mis quejas.

***** necesidad de dolor de cabeza o de tomar analgesico

 en especial frente a una crisis de nervios o a un imprevisto que me
 saque de la rutina

***** necesidad de hacer "competir" por el amor o la atencion

    con un placer perverso de mirar al que esta "perdiendo" la atencion. Este 
    recurso que es ampliamente usado en las peliculas y series.
    P.e. en serie Amor S01E03 donde Mickey ve a Gus que atrae la atencion de 
    otra chica y ella aparentemente se queda mirando de afuera. Y eso explota 
    la perversa cuestion dentro de muchos de nosotros de no solo "hacer 
    competir por el amor" sino de mirar sadicamente al perdedor como diciendo 
    mira lo que te perdiste. Esto que creo que es algo enfermo, debe provenir 
    de la infancia en una etapa en que a uno lo deben haber desplazado en un 
    contexto de amor limitado, siendo que el amor hubiera podido alcanzar para 
    todos. Y de mayor uno tiende a beneficiar mas a uno que a otro. Y a gozar 
    con sadismo de esas diferencias.

***** vivencia de no ser amado
***** vivencia de tener que dejar mi proyecto en favor de un familiar
***** vivencia de que no era dado ni siquiera desear algo
***** vivencia de invisibilidad
** 2018-09 septiembre
*** 2018-09-12 miércoles
**** sensacion de estar atrapado :libertad:
:LOGBOOK:
CLOCK: [2018-10-07 dom 19:41]--[2018-10-07 dom 19:42] =>  0:01
:END:
  En un video que vi ayer de Mujica ex presidente del Uruguay decia que si 
  bien es cierto que necesitamos algunas cosas materiales tambien necesitamos 
  libertad. Y eso me recuerda lo que decia Nietzche que si uno no dispone de 
  la mitad de su jornada para uso propio y para su propio beneficio es un 
  esclavo por mas que la gente lo conozca a uno o lo reconozca como medico o 
  abogado o ingeniero. (Ni que hablar tiene que ni siquiera "gozemos" ese 
  reconocimiento y seamos unos tristes pelagatos que pasemos toda nuestra vida 
  encerrados no solo dentro de una oficina, sino dentro de unos esquemas 
  horarios y contractuales que nos asemejen mas a unos esclavos que a unos 
  hombres libres y todo porque?). Cuando fue la ultima vez que pude disponer 
  de un solo puto dia para mi mismo con total libertad??
  recuerdo aquellos dias del 88 cuando me sentaba en el bar 
  todos los dias a tomarme una tonica y pensaba que lindo seria hacerlo a esto 
  siempre y en realidad no lo hice nunca mas.
  Pero luego reflexione que en realidad uno se carga de obligaciones que no 
  son obligaciones en si mismas sino que son supuestamente cosas que hace por 
  gusto, pero que terminan por aprisionarlo a uno lo mismo.
  Hoy creo que el esquema que me atrapa es mas asfixiante o el torniquete es 
  mas apretado que en otro momento. pq tengo en realidad una obligacion 
  publica real que termina aca tipo 20.30 o mas y cansado pq tengo que ver que 
  ceno. Pero eso no ha significado que el dia se ha liberado, al contrario, 
  muy al contrario, el dia comienza a las 8hs pq tengo que levantarme si o si 
  a acondicionar el dpto que ya al dejar de pertenecer a mi esfera privada pq 
  paso a ser parte de romitex, tengo la obligacion de levantarme a limpiar y 
  mantener ordenado, luego tengo que "correr" por hacer alguna que otra tarea 
  hasta que venga la Cami pq como hay una sola compu si no la hago en ese 
  momento no la puedo hacer despues, luego viene el intermedio tedioso de 
  esperar que la Cami cumpla su turno, pq no tengo compu como para trabajar en 
  algo util, tengo la notbook que mas que para escribir aca no sirve, y 
  tenemos el tremendo problema de la espalda con la silla que ya a pocos dias 
  me esta trayendo problemas de espalda. Y no es solo eso sino la falta de 
  libertad de movimiento dentro de esas horas. Luego comer cualquier basura, y 
  tener que hacer una tarea que no es poca. (Aca vale la pena aclarar que a 
  hoy me saco de encima la obligacion de procesar romitex fichas pq pienso que 
  va a ser dejado de lado pq no va a ser productivo, pero eso me estaba 
  llevando una hora o mas por dia en ese horario critico). Y luego vendria una 
  hora o hora y media que podria ser usada como siesta si no fuera que uno 
  debe tomar multiples consideraciones, el telefono de la oficina, el celular 
  propio, etc. o sea no es cuestion de decir que me acuesto y tengo super 
  siesta, y no es tampoco que se puede dormir aca en el centro. y a correr a 
  la oficina.

**** sensacion de encierro en mi dpto transformado en oficina :problemaCami:libertad:
:LOGBOOK:
CLOCK: [2018-10-07 dom 19:45]--[2018-10-07 dom 19:47] =>  0:02
:END:
   para entender el momento hay que ver que pasaba en el momento ese que 
   surgio el malestar y que paso luego cuando supuestamente aflojo un poco el 
   malestar.
   Estaba muy fiacudo en lo que respecta a salir a la calle, me habia vestido 
   directamente con fajina (eso que pudo haber sido bueno para limpiar, no fue 
   bueno como incentivo para salir), no habia sido una mañana que hubiera 
   tenido que limpiar mucho, el mantenimiento del limpio sobre limpio del 
   dormitorio me fue muy facil, incluyendo abrir para ventilar y limpiar con 
   blem y barrer, o sea no fue eso, platos casi no habia, y el resto no lo 
   toque, pero tuve fiaquento como para plantearme salir a la calle a hacer 
   los pendientes.
   Entonces me quede pero no me encontraba con un lugar, y si me sentaba 
   en la mesa me dolia la espalda y para mi adentro me decia que bajon tener 
   que soportar esta silla o bien que seguir con esta silla me va a romper la 
   espalda. Por eso no escribi mucho que digamos, ademas "perdi" mas de media 
   hora comprobando los recibos de ayer, y no empeze a programar que era lo 
   que tenia que hacer. y mas me dolia la espalda.
   A su vez estaba inapetente y tenia ganas de cagar que me estaba 
   conteniendo.
   me fui a acostar un rato a la pieza horizontal, y me agarraron los 
   temblores mal, eso que estaba fijo en una posicion neutra, y luego cuando 
   me vine a la cocina donde me quede los temblores siguieron. Eso sumo una 
   gran preocupacion. 
   Y en general todo, el verme reducido en movilidad, el tener ayuda, pero a 
   la vez reducirme yo en lo que puedo hacer "mientras" se hace esa tarea 
   termina por hacerme una imagen de agobio multiplicado por dos. Y la 
   sensacion de no poder salir.
   Y en el medio es donde pense en renunciar, en salirme, en pensar cosas que 
   decia Dario Z. mientras comia, o sea en equis dias estare muerto, y si 
   querre haber pasado estos dias asi. Lo mal que me hace estar asi. 
   Y tambien que tengo que seguir viviendo, que no puedo rifar el patrimonio 
   de las chicas, o sea lo mismo de siempre. 
   y comi mi arroz de mierda mientras escuchaba a dario z. y comi un flancito, 
   y luego me puse a imprimir y luego se me acabo el toner, y me cambie la 
   camisa y sali sin problemas a comprarlo y no paso nada. 
   No me acuerdo ahora que quiero relatar lo sucedido, cuales fueron los 
   vectores reales que me llevaron a la sensacion de ahogo y cuales fueron las 
   que me liberaron, pienso que el solo hecho de que la Cami se vaya cuando 
   termina su jornada y quede solo en el dpto ya es liberador para mi. Pero de 
   la carcel mayor no puedo librarme.

*** 2018-09-18 martes
**** pruebo con beroca :cansancio:
:LOGBOOK:
CLOCK: [2018-10-07 dom 19:56]--[2018-10-07 dom 19:57] =>  0:01
:END:
 hoy amaneci bastante normal, decidi no hacer la rutina de hacer la cama ni 
   limpiar sino ir haciendo algo de oficina y me puse a sacar boletas a pagar 
   y contar. Luego llego la Cami, la puse que me ayudara a contar, y luego la 
   deje pasando recibos y empece a pagar cuentas, con la intencion de meter 
   cambio, yendo a tres rapipagos, uno de ellos pagofacil por el tema telecom, 
   me senti agotado en el medio pero contento al fin. Pague todo, y tambien 
   fui a farmacity y compre alimento, prepare el almuerzo y comimos juntos, 
   luego hice la caja, o sea como dia de trabajo rindio bastante bien, y fue 
   un dia de salir a la calle varias veces. Me senti muy comodo saliendo a la 
   calle, totalmente opuesto al malestar del 12/9. No se si influyo el clima, 
   o tambien influyo el cambio en los procesos que estamos llevando a
   cabo. 

** 2018-10 octubre
*** 2018-10-07 domingo
**** domingo en familia de nuevo con dolor :migraña:
:LOGBOOK:
CLOCK: [2018-10-07 dom 19:28]--[2018-10-07 dom 19:35] =>  0:07
:END:
Nuevamente como paso en anteriores domingos luego del asado que se
presento con mas o menos ansiedad o nerviosismo la intensidad extrema
del resplandor (necesitaria traerme los lentes de sol) hace que me
afecte si ya el dia se presento migranoso, y hoy me habia levantado a
las 4 am a tomar un M. Aunque habia avisado que me iba a retirar a
dormirme una siesta en el aire, y el vientito estaba lindo y me pude
aislar comodamente un rato largo no fue excento de ansiedad y estallo
una nueva migrana y termine tomando otro M y se me paso felizmente
pero cuando me levante y tome un cafe al rato se fueron pq los chicos
estaban cansados y a la Mayra le dolia la cabeza y le tenia que hacer
la tarea al Lolo. Es muy intenso estar varias horas con esos chicos y
mas si es a la siesta. Es muy desgastante y mas si uno quiere hablar
temas de negocio, no es factible querer discutir temas de negocio
durante un almuerzo familiar, pq le quita la familiaridad que debe
tener todo y eso no sirve.

**** De que tratara el diario jornales y como estara organizado :jornales:
:LOGBOOK:
CLOCK: [2018-10-07 dom 20:00]--[2018-10-07 dom 20:07] =>  0:07
:END:
 Se trabajara con capturas, las Capturas se hacen de cualquier lado
 con C-0 zero. Las acomoda automaticamente en jornales.org de orgblok,
 y en un datetree organizado por ano/mes/dia, salvo que lo llamemos
 con C-1 C-0 que nos da el calendario para elegir el dia que queremos
 trabajar. automatico inserta un clockin/clockout para poner un
 registro de cuanto tiempo tuvimos en la entrada, lo cual podremos
 sumarlo si queremos en una tabla inicial. Y nos pide un tag, el tag
 es importante, pq justamente la idea es mezclar todo en el jornal,
 como en cada dia habra muchos post de distintos temas, la bocha
 estara en no solo titular los posts sino tagearlos, o sea que el tag
 es lo mas importante pq eso luego con un sparse-tree permitira
 seleccionar una parte del org que queramos leer. Como puse que
 podemos seleccionar solo tags del mismo archivo eso es mas facil pq
 facilita la seleccion.

**** TODO trasvasar todo .dek a jornales :jornales:
:LOGBOOK:
CLOCK: [2018-10-07 dom 20:07]--[2018-10-07 dom 20:11] =>  0:04
:END:
 al menos .dek habria que pasarlo se puede ir leyendo parte por parte
 para ver que tag asignar

*** 2018-10-08 lunes
**** Ya asumio que no trabaja mas conmigo :problemaCami:
:LOGBOOK:
CLOCK: [2018-10-08 lun 15:40]--[2018-10-08 lun 15:41] =>  0:01
:END:
 Por lo menos hemos hablado y seguimos en buena relacion y de paso yo
 me libero de esa presion que he venido analizandola en los anteriores
 post y hoy a la mañana analice bien con ih, lo bueno de todo esto que
 no afecte la relacion con ella, y si ahora ella tiene trabajo con la
 Romi mejor.

*** 2018-10-09 martes
**** ultra dispositivo para dormir :insomnio:
:LOGBOOK:
CLOCK: [2018-10-09 mar 09:10]--[2018-10-09 mar 09:16] =>  0:06
:END:
 anoche luego de un dia muy intenso, pero que dentro de todo lo lleve
 bien pq aunque me vine tardecito del marques como todo lunes
 mayormente no me puse nervioso, y solo apele a una SL cuando la cami
 me mando WApp diciendo que entraba a la tienda Levi y me empezo a
 mandar fotos de los jeans que se estaba probando, hasta que dijo que
 no habia encontrado lo que queria y luego que si la dejaba comprarse
 uno de 800 pesos. Al final la mañana y el dia terminaron con medio
 migral, a pesar que no tuve siesta, solo me recoste una media hora
 que no dormi pq no quise casi pq me puse a leer emacs. Pero era
 grande la modorra, pero se fue con gran cafe, luego de levantarme e
 irme a la oficina y atender a toda la gente. Luego cuando llego la
 hora de dormir, para no tener problemas de insomnio ni dormir mal, me
 puse dos SL juntas (la primer vez que lo hago) y dormi joyita hasta
 las tres que me levante al baño, y ahi me puse otra y tire hasta casi
 las 8 que sono el despertador. Al menos en un contexto de ansiedad
 (pero ansiedad de la buena, esa ansiedad emacsiana) pude dormir bien
 pq vengo de varios dias sin dormir bien.

**** fui a pagar dpto y de nuevo la bruja de la Maria :dpto:matetes:
:LOGBOOK:
CLOCK: [2018-10-09 mar 11:18]--[2018-10-09 mar 11:23] =>  0:05
:END:
 me pregunta por si tengo pagados los honorarios!!!! imaginarse a mi
 se me pararon los pelos de punta pq los honorarios me los cobro en
 negro el pelotudo del "doctor" merlo y esta pelotuda pregunta. Menos
 mal que la deje pasar, pq la mina estaba como sobreexaltada debe ser
 por el quilombo en que se encontro al volver y para volver a poner
 todo de nuevo en orden despues de tres meses. 
Lo patetico de todo es que ya pago el 4to mes de alquiler y no arregle
 el caño de la cocina, y ya pienso en mudarme. Tendria que agregar
 este tema a matetes.

**** altibajo animico durante el fin de semana :estadoAnimico:findes:
:LOGBOOK:
CLOCK: [2018-10-09 mar 12:09]--[2018-10-09 mar 12:15] =>  0:06
:END:
Mirando en retrospectiva los findes, en especial el ultimo siempre me
agarra un arrepentimiento sobre mis actitudes pq no me explico pq tuve
ciertos momentos en los cuales parezco no disfrutar el momento
presente con alegria. Luego que vinieron los chicos y estaba sentado
con el Fede en vez de disfrutar el momento ahi con el hablando de lo
nuevo, me puse agresivo tocando un tema que no venia al caso o sea los
errores de venta, sabiendo que eso era algo que lo iba a poner mal, y
que ni siquiera lo habia chequeado yo, todo pq no pude estar atento al
finde, igual con el tema de llevarla a la Cami a su salida cosa que no
me lleva mas que media hora y no me cuesta nada, y todo pq en el fondo
siempre tengo como una actividad pendiente que hacer que supuestamente
lo que viene o sea el momento presente viene a "interrumpir" en este
finde fue la emacsiada. Y en el pasado tambien. Los otros anteriores
fue la filosofia y la lectura. Lo llamativo es que estando en mi casa
no dejo de hacer otras cosas como dormir la siesta por eso, -bueno a
veces si- Pero creo que es algo que hay que cambiarlo. 

**** soy una maquina de quejas :ih:matetes:dpto:
:LOGBOOK:
CLOCK: [2018-10-09 mar 12:39]--[2018-10-09 mar 12:44] =>  0:05
:END:
estaba atorado pasando un millon de recibos y tenia la cocina con olor
a podrido pq no lave los platos el viernes al irme y ayer lunes
tampoco, y voy haciendolos de a poco, y entre en panico, pq pense me
falta una hora de planillas imprimir, y me queda la planilla del mes
de caja, contar la plata y demas no llego a una minima siesta y este
lio, pensaba en la Cami, pero me dije textualmente la Cami es una
inutil no me sirve, e internamente pensaba lanzarle toda esa queja a
ih. Y hace un rato pensaba que cada vez que fui a pagar el alquiler y
estaba Maria la considero una candidata a que me escuche quejas, o sea
soy un bicho que se queja, o sea un cincuenton quejoso, pobre de la ih
que su funcion es escucharme y yo no la quiero escuchar pq solo quiero
quejarme de todo. Al final me puse y en dos minutos, lave las dos
ollas que podian estar podridas y me saque el reloj y puse un balde
con procenex y pase el piso de la cocina y listo, no tarde mas de
cuatro minutos. 

**** me quede sin la siesta por ahora :libertad:
:LOGBOOK:
CLOCK: [2018-10-09 mar 19:40]--[2018-10-09 mar 19:42] =>  0:02
:END:
Es por el trabajo, pq durante el horario en que me aislaria por motivo
de la siesta p.e. Fabian me pidio dos cuentas nuevas y al final es
cuestion de costumbre, me quedo leyendo aunque descansando quizas en
un tiempito con aa y luego me cambio tomo un cafe y me vengo a la
ofi. Y luego duermo bien a la noche.

*** 2018-10-10 miércoles
**** segunda noche con ultradispositivo y sin siesta :insomnio:
:LOGBOOK:
CLOCK: [2018-10-10 mié 08:39]--[2018-10-10 mié 08:43] =>  0:04
:END:
dos SL y caigo redondo sin musica y duermo total, a pesar de que
anoche me despierto raro a las 2.30hs cuando es la hora del primer
pis, y pienso que tengo gases, doy unas vueltas por la cocina para
tomar un poco de agua, le echo la culpa a la gaseosa, y me sale vomito
de ... arroz yamani en seco!! horrible, al respiro fui a tomar agua al
menos que saliera mas fluido pero no salio nada y no jodio mas nada,
y segui durmiendo joya y sin tomar una tercera SL como habia hecho la
primera noche del ultradispositivo

**** atoramiento de tareas atrasadas en ciertos momentos :matetes:dpto:
:LOGBOOK:
CLOCK: [2018-10-10 mié 08:44]--[2018-10-10 mié 08:53] =>  0:09
:END:
Anoche salia de la oficina chocho, gozando de que la oficina esta
linda, y que la jornada no habia sido tan mala y me disponia a
disfrutar de la peatonal, cuando me llama el Fede para decirme que iba
a venir a buscar plata... O sea me entra un suceso externo. Ahi me
cambia todo el panorama. A la mierda la bucolicidad de la peatonal,
regreso a mil, y decido ir al super a comprar queso al menos, pq
cuando abro la puerta del vestidor explotaron como veinte polillas un
desastre, no se que mierda pasa con eso. Y me fui al super, menos mal
que no habia mucha gente pq encima me iba a malquistar. Y solo compre
queso para hacerme un arroz, y no tenia queso, y compre una paso de
los toros  pq antipolillas no habia, y debo decir que antes me tome
una SL pq la situacion era superestresante. Lo que debo averiguar si
es que me produce urticaria que me visiten (ya sea el Fede, la Cami, o
quien sea), o lo que pienso yo que es la razon que el dpto sea un
desastre de mugre y desacomodo y que ni siquiera tenga vasos limpios o
sea que el estado de problematica de dpto ya excedio lo normal. o sea
que estamos en esa situacion que describi a esa prospecto de
limpiadora que atendi en la oficina no tener un dpto para recibir
gente en condiciones, o me molesto pq las visitas me sacan de mi plan
original que pueda ser comer, leer etc. Yo me inclinaria por el
segundo en estos momentos. 

**** ataque ansiedad al volver del banco :ansiedad:
:LOGBOOK:
CLOCK: [2018-10-10 mié 11:20]--[2018-10-10 mié 11:24] =>  0:04
:END:
causado por la avalancha de cosas por hacer. Todo pq veo una TB9 justo
al doblar en gama y me doy la vuelta y veo que corre a la parada del
42 rumbo a mosconi, y luego subo mascullando bronca, y encuentro el
dpto tufado y lo considero no apto para nada, y ahi pienso que un
objetivo seria tener el dpto apto. Falta mucho en todos los sentidos,
pero principalmente poner al dia los papeles, veo los papeles sobre la
mesa, tengo que contar la plata, hacer la caja, pasar las ventas, etc
y el calor insoportable, me tomo una SL y caigo en ansiedad, luego se
me va a pesar de la mala noticia que me da ih sobre que la Romi
abandona la idea de la enseñanza y entra en crisis personal ella misma.

**** dolor implantes inf. derechos :sintomas:implantes:
:LOGBOOK:
CLOCK: [2018-10-10 mié 13:16]--[2018-10-10 mié 13:19] =>  0:03
:END:
anoche mientras comia el arroz senti una sensacion de dolor no
dentaria tipo carie pero si como inflamatoria alrededor de la encia,
pero luego me fui a dormir, y a la mañana cuando me lave los dientes
me molesto un poco y luego paso. 

**** sigo con el tic de empujar con la lengua :sintomas:dientes:
:LOGBOOK:
CLOCK: [2018-10-10 mié 13:19]--[2018-10-10 mié 13:21] =>  0:02
:END:
hasta producir dolor en las protesis en distintos lugares, y me tomo
otra SL para evitar el nerviosismo que me lleva a hacer eso no quiero
tener problemas por culpa de eso.

**** objetivo concentrarse en org-mode unicamente :estudio:
:LOGBOOK:
CLOCK: [2018-10-10 mié 15:30]--[2018-10-10 mié 15:38] =>  0:08
:END:
lo que veo que es que si me concentro en eso solo puedo realmente ir
buscando la forma de que podamos gestionar de otra forma el tiempo y
las cosas para ser mas eficientes. pq no queda otra. Cada capacidad
que uno adquiere y domina pasa a otro nivel. No hablemos de dominar
bien, P.e. las capturas ya son un paso genial que o tenia antes y creo
que estan limitadas a la imaginacion. Y hay muchisima documentacion al
respecto.
El tema tablas tambien y falta repasar el tema formulas y calculos, y
el tema busquedas, agendas etc etc.
Obviamente todo va a ser mas operativo con el uso continuo. pq el uso
hace a la funcion. 

**** estoy enviciado con emacs/orgmode :bitacoraOficina:
:LOGBOOK:
CLOCK: [2018-10-10 mié 20:10]--[2018-10-10 mié 20:14] =>  0:04
:END:
En todo momento estoy con lo mismo, y aunque atiendo bien a la gente y
me paso el dia trabajando pasando los papeles y produciendo lo que
hace falta, pero no me queda tiempo para las cosas diarias en mi casa,
y para el relax, y todo tiempo libre lo paso o bien leyendo cosas de
emacs o bien haciendo posteos (que no es algo malo en si pq son
posteos de la situacion en que me siento en momento presente) y lo
malo es que creo que la emacmania o la orgmania me da la sensacion o
me agrava la sensacion de falta de tiempo, pero en realidad la falta
de tiempo la tengo igual, y esto en realidad lo que hace es a la larga
beneficiarme y ayudarme a organizarme y me da la posibilidad de
aprender algo.

*** 2018-10-11 jueves
**** resolucion de algunos matetes :matetes:ansiedad:problemaCami:
:LOGBOOK:
CLOCK: [2018-10-11 jue 13:20]--[2018-10-11 jue 13:27] =>  0:07
:END:
hoy reincorpore a la Cami para que pase los papeles pq estoy
desbordado de pasar yo mismo la pila de papeles, en ese interin limpie
a fondo la habitacion y planche tres camisas. Y no tuve ansiedad ni
tuve necesidad de tomar ningun SL. veremos como sigue la cuestion. Lo
que me plantie en el fondo fue que si ella pasaba los recibos y
fechaba yo si queria podia controlar en pocos minutos en la compu, no
en listado que es un dolor de bolas, y el fechado en el fondo lo puede
hacer ella cortandome las cosas que son mas relevantes. Y tambien que
con el sistema de pendrive puedo yo a la tarde cuando me van dando las
planillas ir pasando lo relevante o ir ojeando lo relevante y
pasandololo yo, o bien separandolo yo, igual a la noche cuando llegue
y dejar lo rutinario que lo pase ella. Igual el imprimir intimaciones
puedo hacerlo en la oficina. O sea menos trabajo en la casa, mas
trabajo en la oficina. Y pongo mi vida al dia que de otra forma no se
va a poner al dia y va a ir rumbo al colapso. 

**** hoy disminucion de ansiedad :ansiedad:insomnio:
:LOGBOOK:
CLOCK: [2018-10-11 jue 15:29]--[2018-10-11 jue 15:36] =>  0:07
:END:
Empezo anoche cuando vine de la oficina. Me puse a cambiar el sistema
operativo!!! pq no me andaba la impresora, lo cual habia sido un
embole mayusculo por la tarde ya que imaginarse que la impresion es
algo basico en mi sistema. Vi alguna hp y no bajaba de 16k!!!. Ni
siquiera pude terminar de imprimir los recorridos. Al final decidi
cambiar por Solus. Y me tire a la pileta!!, empece y no cene, tome
medio litro de licuado y termine a las doce y cuarto con unos
problemas resueltos barbaros con tcl y python, que son totalmente
atipicos. La impresora ni hablar. 
Me tome dos verdes, y a dormir, dormi muy bien, pero con medio a la
noche tipo cinco, con tecito y dos coquitas, y segui hasta las
9.40!!!! pq no habia puesto el despertador. Lo cual estuvo joya. Ahi
me escribe la Cami y yo con muy buen humor le digo que si que venga a
desayunar conmigo que le iba a dar la mesada. Una vez desayunando
tranquilos como que era sabado o domingo, eran las 10 y media casi, le
propongo que vuelva a trabajar, y la pongo a pasar los recibos, y yo
me pongo a limpiar la habitacion y a planchar. Y no senti ansiedad,
incluso la invite a la Romu, y tuve energia para lavar los platos, y
encarar la limpieza que falta. (El dia ayuda y el nivel de energia que
yo tenia tambien.) Luego me aboque a instalar la impresora y lo logre
sin demasiadas complicaciones aunque no a la primera instancia, y ya
tengo el sistema de nuevo en funcionamiento. 

**** organizacion de la jornada con la Cami trabajando :dpto:
:LOGBOOK:
CLOCK: [2018-10-11 jue 15:37]--[2018-10-11 jue 15:43] =>  0:06
:END:
Pienso que si ella pasa lo grueso o sea los recibos, las ventas, y los
fechamientos, y encarpeta las ventas, me saca un gran trabajo de
encima, y aparte la mando a comprar, tanto al super, como la comida,
como las hojas y el toner, o sea es mucha la ayuda que tengo. Y de
paso la tengo aca conmigo.
Yo por lo pronto quiero empezar a limpiar el dpto, esa sera la primer
estrategia y el primer objetivo y a descansar mas. 

**** sigue molestia en molar implantado derecho :sintomas:implantes:
:LOGBOOK:
CLOCK: [2018-10-11 jue 19:55]--[2018-10-11 jue 19:59] =>  0:04
:END:
en el area de la encia alrededor, como si se hubiera inflamado con el
cepillo o bien un proceso. Voy a aprovechar el sabado que vaya a
pagarle al doc para consultar

*** 2018-10-12 viernes
**** segundo dia de sistema :ansiedad:hijas:insomnio:migraña:
:LOGBOOK:
CLOCK: [2018-10-12 vie 14:12]--[2018-10-12 vie 14:17] =>  0:05
:END:
segundo dia no dormi muy bien con ultradispositivo, pq me desperte con
ultramigraña a las 4am y se notan las dos verdes, estoy como boleado,
me tome un migral entero con cuatro tragos de licuado y me volvi a
dormir, y me costo despertarme pero no considero que dormi tan bien
como ayer p.e. que no puse despertador. Me desperte a las 8.am.
La Cami vino retemprano, mejor pq empezo bien y temprano. Yo me
levante desayune y conte el dinero, fui al banco, y volvi lave un poco
de platos con dificultad, y pense en seguir limpiando a fondo y me
decidi por meterle al encarpetado de los documentos.
Lo inicialize yo, y luego lo siguio la cami, invitamos a la Romi a
comer, y la Cami se fue con su amiga, y me quede con la Romi, comimos
juntos, y encarpeto ella el segundo muy bien!!!. Tengo los dos
encarpetados y al dia. O sea metimos 600 documentos en carpeta en un
solo saque. Ahora me falta llevar los papeles. Sigo con ansiedad cero,
y me parece que la relacion con las hijas aca fluye de otra forma lo
que estoy mas relajado en cuanto a horarios.

**** TODO objetivo acomodar los archivos de orgmode :orgmode:minimalizacion:
:LOGBOOK:
CLOCK: [2018-10-12 vie 14:18]--[2018-10-12 vie 14:19] =>  0:01
:END:
lo puedo hacer en cualquier lado, es algo divertido y a la vez es util
para que rinda mejor el esfuerzo.

*** 2018-10-13 sábado
**** mala experiencia con helm :orgmode:emacs:
:LOGBOOK:
CLOCK: [2018-10-13 sáb 15:31]--[2018-10-13 sáb 15:34] =>  0:03
:END:
para desinstalar en otras maquinas desinstale emacs y volvi a
instalar, y en la notebook no hizo falta, directamente borre el
directorio .emacs.d/ y luego reinstale todos los paquetes que uso y
quedo una instalacion limpia de nuevo.
prefiero usar asi. Helm era muy invasivo, incomprensible y estorbaba
en la asignacion de tags en orgmode.

*** 2018-10-14 domingo
**** solo en la cabaña estaba tranquilo :ansiedad:CE:findes:matetes:libertad:
:LOGBOOK:
CLOCK: [2018-10-14 dom 12:35]--[2018-10-14 dom 12:47] =>  0:12
:END:
Noto que aca en el marques no estoy tranquilo sino que estoy a la
espera. pq se espera que hagamos algo. En vez de disfrutar el tiempo
libre como mas te plazca y rascarte los huevos a cuatro manos y hacer
lo que te venga a la gana, mas alla que alla estabas en el campo y
entonces ya le quitabas "el elemento" que te rompe las pelotas
cronicamente en la vida o sea que no salis, pq ya estas en estado de
salido, o sea vivis salido, entonces no tenes que salir, vos vivis
tranquilo, si quieren visitarte que vengan a verte, y como la
distancia es lo suficientemente larga eso hace que cada uno haga su
vida y no te rompan las pelotas. Lo unico que te causaba problemas
eran las chicas que no les gustaba pq querian salir a otro lado y asi
sucesivamente.
Pero aca me siento siempre ante la obligacion que o bien falta algo en
el sentido siguiente:
1. que no "salimos a algun lado"
   - el problema es que desde mi punto de vista esta es "la salida a
     mi semana" o sea no me siento muy con ganas de un plan de salir
     desde aca a otro lado.
2. que tenemos que incluir dentro del fin de semana una actividad con
   el Fede y la familia.
   - no solo que me caga a veces el tema de esa indecision de no saber
     cuando es la "juntada" o que es demasiado larga, o que no me
     gusta o etc. y a lo mejor queda como obligada y no se sienten
     comodos conmigo
3. que hay alguna cuestion de "negocios" que quedo por tratar.
   - como costumbrismo siempre decimos el finde lo terminamos de
     definir y lo que menos hacemos el finde es trabajar juntos, lo
     cual esta bien, y termino a veces frustrado pq a lo mejor no se
     hablo o no se trabajo nada mas que cinco minutos, y se podria
     mejor trabajar dentro de la semana.
PD: este domingo siendo el medio de un finde largo es peor pq vino la
consuegrada y cometimos el error estrategico de no ir a saludar apenas
vinieron, y quedo una seudoinvitacion del fede para ir a comer, y
hasta ahora no se han hecho presente, y eso en el fondo te tiene las
bolas al plato, pq ni siquiera quiero ir para alla, y encima viene ih
que la del super le dice "van a ir a algun lado??"

**** avance bastante en aprendizaje y en arreglo :findes:orgmode:
:LOGBOOK:
CLOCK: [2018-10-14 dom 17:32]--[2018-10-14 dom 17:38] =>  0:06
:END:
Como dos caracteristicas muy grandes que hice en esta siesta tengo la
instalacion de un navegador interno de emacs muy potente, que creo
agilizara por diez la tarea de cualquier tipo que se trate, el w3m, y
toda la puesta a punto del encriptamiento de nodos con el aprendizaje
de la clave GPG tanto en generacion, en backupeado, en exportacion,
luego importacion a otras maquinas, y posibilidad de tener en el git
en forma transparente los orgs con los nodos mezclados tanto los
abiertos como los pgpeados.
Antes de eso trabaje bastante sobre el tema de Archivo que permite ir
guardando y desactivando los org viejos que molestan pero que son
lindos guardarlos, y ya manejo bien el refile, y los capture template,
agregue otro template para habit.
No he avanzado tanto en achurar archivos pero eso es la parte facil.

**** NEXT objetivo de estudio y forma de realizarlo :estudio:orgmode:emacs:OBJ:
:LOGBOOK:
CLOCK: [2018-10-14 dom 17:38]--[2018-10-14 dom 17:40] =>  0:02
:END:
Creo que la forma de realizar la incorporacion definitiva y plasmada
de los conocimientos para llegar al fondo de la cuestion es la
impresion por capitulos separados como hice con orgmode y su
correspondiente lectura y asimilacion completa. pq eso luego lleva a
su aplicacion he incorporacion a la base de datos actual.

**** sigo con dolor en implante y sangrado encia :implantes:sintomas:
:LOGBOOK:
CLOCK: [2018-10-14 dom 22:22]--[2018-10-14 dom 22:23] =>  0:01
:END:
sigue el dolor en el mismo nivel, parece encia, y ahora sangra al
lavar los dientes pero no mucho.

**** tres SL un domingo!! :findes:ansiedad:
:LOGBOOK:
CLOCK: [2018-10-14 dom 22:23]--[2018-10-14 dom 22:29] =>  0:06
:END:
desde esta manana que me agarro el ataque de ansiedad cuando ih vino
del minisol y dijo que si no ibamos a algun lado y de ahi analize todo
respecto al fin de semana, y estar esperando a Godot, tome el primer
SL. Luego me pase la siesta super bien, aunque tome medio migral, con
gran avance que describi en otro post. Luego se levanta ih y cuando le
cuento todo esto o sea la teoria de que el fin de semana me pone
ansioso y porque, me pongo ansioso de tal forma que no puedo hablar
bien, y me tomo un segundo SL, y estoy todo ansioso por dentro, lo
siento en los brazos en el cuerpo entero. Y nos ponemos a ver un
capitulo de Ministerio del Tiempo, luego me pongo de nuevo en la
maquina agotando una carga de notebook pero sin tanto exito en el
resultado, y la ansiedad ahora se manifiesta con el tic de empujar los
dientes y me tomo un tercer SL. Y pienso que todo es lo mismo. Al
final un dia que tendria que ser de relax total termina siendo de
dopacion total.

**** learn/anki/drill no funciona :orgmode:
:LOGBOOK:
CLOCK: [2018-10-14 dom 22:52]--[2018-10-14 dom 22:53] =>  0:01
:END:
 learn / drill 
 al M-x customize-variable RET org-modules RET vi que hay un modulo de
 learn con el algorritmo supermario. para ver 
 ambos dan error, no andan. que bronca.
Lo volvi a probar hoy y tampoco funciono.

*** 2018-10-15 lunes
**** formas de tagear en journal :orgmode:
:LOGBOOK:
CLOCK: [2018-10-15 lun 17:55]--[2018-10-15 lun 18:02] =>  0:07
:END:

***** usar el tag OBJ para objetivos

cosa que siempre hacemos o hicimos, y asi podemos identificar un post
con dicho tag como objetivo, y adosarle otros tags como alimento o
ejercicio o dpto o estudio etc. para filtrar, y tambien se puede jugar
luego que uno filtre los OBJ mas recientes o activos, con TODOS> NEXT,
DESISTIDO, DONE. o sea un search muy interesante podria ser para
tag/todos OBJ/NEXT lo cual nos daria los objetivos que estariamos
trabajando y de alli concretar acciones en agenda o reformularle el
titulo para que sirvan para nextaccions.  Y de paso tendriamos una
vision a traves del tiempo de todos los objetivos como van o
permaneciendo los mismos o cambiando a traves del tiempo.

***** usar el tag RELEER para post destacados

cuando releemos p.e. ahora que tengo que hacer refile hay post que
vale la pena destacar del resto se pueden tagear a posteriori con este
tag, cosa que no sale en el momento de escribirlo pq no sabiamos que
era una porcion memorable.

**** pasar TODOS los escritos a un solo archivo :orgmode:OBJ:matetes:
:LOGBOOK:
CLOCK: [2018-10-15 lun 18:38]--[2018-10-15 lun 18:47] =>  0:09
:END:
como es tan sencillo mediante el capture y el C-1 C-0 y con el
movimiento rapido a traves del calendario, hace que podas meter el
post dentro del arbol del journal original, y de paso tageamos bien. Y
de paso releemos en el momento, o sea no solo debe ser un trabajo
rutinario y rapido para luego leer algun dia.
Creo que la suma de poder tagear profusamente, acomodar en el arbol
cronologico, y a la vez marcar encryptado lo que sea necesario. Mas la
posibilidad de ir escribiendo abajo nuevos posts relacionados, incluso
usar links vale la pena.

*** 2018-10-16 martes
**** terminacion finde superlargo :ansiedad:findes:
:LOGBOOK:
CLOCK: [2018-10-16 mar 09:39]--[2018-10-16 mar 09:44] =>  0:05
:END:
termino el martes a la mañana un finde que empezo el viernes a la
tarde.
y fue signado por el tema de esperar que nos invitaran a comer como
habian quedado, y aunque el tema fue sacado y aclarado, aunque no
entendido en su momento causo mucho desasiego en el fin de semana y
causo mucha ansiedad y varios SL. 
En general dormi bien, curse con poco migral, y hoy a la mañana un
poco me puse ansioso por la salida pensando que no iba a conseguir
taxi pero a pesar del caos vehicular pudimos salir tranquilos.

**** limpie vestidor y mesas de luz :tareaExtra:
:LOGBOOK:
CLOCK: [2018-10-16 mar 13:10]--[2018-10-16 mar 13:16] =>  0:06
:END:
pase toda la ropa de invierno a cajas, saque bultos a llevar a
marques, limpie y acomode en cajas lo que habia en mesas de luz,
liberando un poco el caos, limpie con blem, cajon y abajo, libere
mucho espacio en sector de perchas y quedo con las camisas que puedo
llegar a usar en la temporada. Las cajas mas o menos estan
clasificadas, por temas y no estan tan colapsadas, o sea que se podria
considerar terminado el vestidor. faltaria rociarlo con antipolillas
para eliminar esas maripositas molestas. Esta tarea la hice durante la
mañana aproximadamente entre las 10.30 y las 12.30, pq no lave platos
ni tendi cama, pq pense que era mejor hacer una tarea de base y luego
seguir con lo de arribita y no seguir evadiendo la tarea de base. para
siempre. 

**** Este tag es un analisis de la organizacion en org :infoOrg:
:LOGBOOK:
CLOCK: [2018-10-16 mar 13:16]--[2018-10-16 mar 13:26] =>  0:10
:END:
Como organizar los archivos y como organizar los tags.

***** Implemente el tag tareaExtra

para describir toda aquella tarea que haga en el dia a dia que no sea
rutinaria ni se haga siempre, siempre en funcion de hacer un sparse
tree y ver cuales y cuando fueron las tareas extras que hicimos

***** implementar las recetas como tag no como archivo extra

para que poner otro archivo, si mejor tener todo en uno y con un tag
adecuado poner la receta y luego la buscamos facilmente.

***** implemente una seccion cobradores casos con sus tags

esa seccion contendra los casos que deben seguirse y agendarse.
Eso siempre fue un pain con la base de datos y nunca lo logre, y con
esto es una papa. 
Tengo suboutines con los numeros de los cobradores con tag a los
mismos numeros, cosa que todas las tareas lo hereden, luego viene el
caso, que puede tener un schedule pq tiene que saltar con un suceso
futuro ya sea cuando vaya a cobrar o algo asi. (ahi venia el pain de
la base de datos), y abro el todo. y describo el problema.
y tageo de nuevo a la zona. Luego viene el tema o bien agenda view,
que luego podre tener programadas vistas ad-hoc para filtrar y ver o
bien las filtro a mano segun cuantas vayan siendo. Pero lo libre es
poder poner todo tipo de casos, para que quede registrado
todo. Incluso los reclamos, pendientes, etc.

**** me inocule de common lisp :freakismo:
:LOGBOOK:
CLOCK: [2018-10-16 mar 22:00]--[2018-10-16 mar 22:02] =>  0:02
:END:
y estoy distrayendome de esto hasta el punto de alejarme de lo
principal que seria terminar de organizarme en orgmode y en en el
trabajo. P.e. estoy teniendo problemas con la agenda view por cobrador
para recordar asuntos pendientes en el momento en oficina, y en crear
trabajo que valga la pena en los pocos momentos de maquina efectivo
que tengo como para tener que lidear con otra cosa nueva.

*** 2018-10-17 miércoles
**** dispositivo a toda maquina :insomnio:
:LOGBOOK:
CLOCK: [2018-10-17 mié 08:37]--[2018-10-17 mié 08:40] =>  0:03
:END:
anoche dormi muy bien a pesar de haberme despertado a cierta hora y
pensar que era hora de despertarme, y eran las 6 y pico y me volvi a
dormir. A pesar del ruido, creo que las dos verdes por ahora superan
el ruido y te permiten dormir muy bien. En especial si no has cenado
nada. 

**** un dia como cualquiera :estadoAnimico:hijas:orgmode:
:LOGBOOK:
CLOCK: [2018-10-17 mié 15:37]--[2018-10-17 mié 15:43] =>  0:06
:END:
Hoy parece que no hice mucho, pero tenia mi plancito hecho desde ayer
en mi lista (tiene que ser en smart no puede ser en emacs todavia pq
no hay integracion y no hay maquina disponible pq deje la notebook
alla). Me hice licuado, y conte y deposite, que era lo planeado y
compre migral, quedo pendiente comprar beroca por el precio. 
Luego me puse bermudas para hacer mas soportable aca dentro el trabajo
y me puse a pasar listados para ayudar a la Cami , es que el finde
largo fue fenomenal, 82k de cobranza y 200 paginas de listado a pasar
al menos, ella me compro las cosas y luego se fue. 
Lo bueno es que la relacion con ambas hijas mejoro un poco o bastante,
la comunicacion es mas fluida incluso tenemos un canal propio mas
directo. Y me hice la primera comida en serio, comi un bife con
cebolla y pure hecho en pocos minutos. 
Lo poco que lei en el banco pq fue rapido es que hay mucho para
aprender y organizarse en orgmode todavia para que podamos estar
medianamente organizados en un matete tan grande como el que
tenemos. Pq estamos queriendo facturar una pasta y estamos sin gente y
asi no se puede. Pq no hay tiempo. Pq yo trabajo todo el dia y no
tengo tiempo para nada. Pq te lleva tiempo hacer las cosas. 

**** limites entre oficina.org y programar en tcl :orgmode:programacion:
:LOGBOOK:
CLOCK: [2018-10-17 mié 22:16]--[2018-10-17 mié 22:22] =>  0:06
:END:
creo que se empieza en orgmode por la rapidez, luego se ve si la
funcion lo amerita y uno ve que hay voluntad de recopilacion de
informacion durante un tiempo razonable se programa algo en la base de
datos en forma definitiva. 
Obvio que seria bueno un CMR todo interrelacionado con todas las
funciones pero no lo tenemos y tengo esto ahora, que aunque tampoco lo
se manejar estoy mas cerca, y luego vere como puedo ir
mejorandolo. Pero por ahora recopilo informacion que sea relevante y
que se pueda recopilar no cualquier informacion porque ese es el
problema.
A veces no anotamos cosas importantisimas que van pasando o que nos
van diciendo los cobradores para hacer seguimiento, para lo cual
orgmode se presta un monton, como se presta para las anotaciones de
bitacora y estrategia en un solo archivo. Y otros registros como
cambios, y devoluciones, que antes no registrabamos. O tampoco los
documentos llevados por los cobradores, o cosas asi. Ahora todo lo
relevante esta en un solo archivo que esta abierto toda la sesion de
atencion de cobradores de dos horas.
Como estaba abierto el log de programacion durante la programacion y
alli quedo plasmada toda la historia de la programacion que hice.
Y este jornal un poco anota todo lo que hago.

**** dieta carne :alimentacion:
:LOGBOOK:
CLOCK: [2018-10-17 mié 22:22]--[2018-10-17 mié 22:25] =>  0:03
:END:
hoy comi carne mediodia y noche. No digo que voy a hacerlo todos los
dias, pero aproveche el bife fresco pq freeze la mitad nomas. Cocinar
no me supuso mucho tiempo. Las compras las hizo la Cami. 
Mañana compro de nuevo para licuado y creo que eso va a levantar mas
rapido que un frasco de beroca.

*** 2018-10-18 jueves
**** tags para clientes :idea:
:LOGBOOK:
CLOCK: [2018-10-18 jue 13:26]--[2018-10-18 jue 13:38] =>  0:12
:END:
pensar las ideas de orgmode y tratar de traducirlas para la base de
datos. 
Pensar la idea de tags. Y como un tag se puede pegar a un cliente. y
luego permitir la busqueda de ese cliente. Supongamos que un cliente
vive en Dominica 1960 entonces el tag Dominica1960 se le adosa de por
vida, eso no cambia, por mas que cambie de direccion o nada. 
Los tags se podrian representar por buttons y al presionarlos se
podria obtener un tablelist con todos los registros que comparten ese
tag y los otros tags e ir filtrando. 
Tambien se podria manejar por tag la situacion de moroso, incobrable,
o mudado, o devolvio. 
y eso permitiria analizar mejor las situaciones.
Incluso luego con los parentezcos que habria que pensar como
incluirlos como tags. 

**** reflexiones :freakismo:
:LOGBOOK:
CLOCK: [2018-10-18 jue 14:41]--[2018-10-18 jue 14:54] =>  0:13
:END:
anteayer pensaba sobre el freakismo pq me sentia atraido en la lectura
de lisp en forma pura y pensaba que esto me estaba apartando de
orgmode basico. Y luego que en el banco ayer vi como en la agenda
ponian linkeos a calendario me puse a husmear sobre holidays y me meti
a mayores vericuetos como pasa en esos casos para pasar el tiempo, pq
pasa asi, uno no lee organicamente, por eso yo propuse el otro dia,
imprimir capitulos completos para "trabajarlos de una cierta forma" y
tenerlos fisicamente a mano para poder volver a ellos y al menos
distinguir lo que seria teoria de base del boludeo de buscar la quinta
pata al gato y en este sentido fue que encontre una repuesta en
reddit:

Um, I don't really do all that. Guess I just keep track of relevant
dates in my head -- not that hard to do, and it's good exercise for
your brain. I mean, you would think that I would use some tool for
organizing time considering that I am working full-time while
constantly traveling around the world -- and yet I've yet to yet miss
a plane or a deadline at work. I don't know, my dude -- when I start a
Masters one day I will probably begin using some kind of time-tracking
system, though it will likely be paper-based. I find paper-based
systems much more useful and convenient than electronic ones -- I
don't need to constantly carry around some electronic with me (and I
don't have to bother with unlocking the device, opening the app,
forgetting to synchronize, etc. -- I just check my notepad and/or
write down my next appointment). As for note-taking, I would also
carry around a notepad and take it out when I need to, but I'd then
copy everything over into org-mode. I already am a big user of
org-mode since organizing notes and searching through them is much
easier than with a 100% paper-based solution. I guess some people want
such advantages for time-tracking too, but for me it's too much effort
and not enough reward. Okay, I guess the whole clocking your tasks in
org-mode is a nice feature -- but do you really need this? And
personally, my tasks are complex enough and intertwined enough that I
cannot really clock them in an independent way and if I were to try to
do so, the data would be mostly meaningless. But hey, everyone's
different -- and my hyper-optimized, surprisingly paper-biased
workflows may only work well for me. There's just not enough data here
to be able to give general advice and be confident that "hey, I'm
certain this applies to you!" -- no. This isn't so much advice as it
is food for thought, though it could also be advice if you think this
would be helpful to you -- in which case, please write back and let me
know if my advice was useful!

En otras palabras creo que lo que pude entender es que para que
preocuparse por lo que yo llamo la quinta pata del gato, o sea
distraerse o preocuparse por funciones que no usamos o cubrimos mejor
de otra forma si tenemos una enorme funcionalidad, gigante
funcionalidad a nuestra disposicion para hacer andar.

Por otro lado pienso que todo lo que aprendemos y leemos tiene
continua implicancia en el trabajo, pq nos van ocurriendo ideas que
pueden provenir de otros sistemas y de otras formas de hacer las cosas
que ahora no tenemos. Como la recientemente esbozada idea de tageado
de clientes, para rapida busqueda de situaciones y clasificado de
clientes. Son ideas que deben ser desarrolladas en extenso pero ya
empezaron a calar y bueno pueden ser buenas a futuro, pero por ahora
sigamos explorando, lo bueno es que no se pierde nada. 
Y no es freakismo algo que a mi me gusta.

**** avance gigante el volver a filtrar por mobile :bitacoraOficina:
:LOGBOOK:
CLOCK: [2018-10-18 jue 19:37]--[2018-10-18 jue 19:41] =>  0:04
:END:
Creo que fue un avance gigante volver a filtrar por nuestra base de
datos y con la mejora que le hice de que se vean en forma clara.
Creo que fueron muchisimos los mocos de venta que se cometieron en la
ultima pasada y todo por causa de no tener el cuidado minimo de
protegerse de la cuestion calle. Por eso pienso que la informacion es
de vital importancia pq cada frase cuenta en el momento de tomar la
decision.

**** necesidad de un F13 moderno en TCL :programacion:
:LOGBOOK:
CLOCK: [2018-10-18 jue 19:42]--[2018-10-18 jue 19:47] =>  0:05
:END:
en especial para aprobacion de creditos, con visualizacion de los
"tags" y las supraentidades o sea las casas o clanes. 
Estaria bueno un sistema de buffers tipo emacs por medio de tabs
quizas p.e. donde la info se expandiera y saliera en otro tab y se
fueran agregando los tabs, los cuales luego se podrian cerrar a
discreción con doble click. P.e. una busqueda o un detalle ampliado de
un cliente, eso limpiaria la pantalla principal.

*** 2018-10-19 viernes
**** atoramiento de improductividad :problemaCami:migraña:problemaTiempo:
:LOGBOOK:
CLOCK: [2018-10-19 vie 11:22]--[2018-10-19 vie 11:29] =>  0:07
:END:
Senti un momentaneo ataque de improductividad estando la Cami aca sin
hacer nada pq ya hizo todo temprano y creo que volvemos a caer a lo
mismo de siempre. 

***** ganamos muy poquitas rutinas

pq que rompa los papeles dia a dia, que encarpete dia a dia y asi. 

***** pero... sigo confiando en que no cometa errores

o sea no da la ecuacion del tiempo para corregir errores, o sea que si
siguen apareciendo errores se va a armar la gorda.

***** no es factible delegar tareas por mas nimias que sean

hace dos dias que tengo que comprar nueces y pasas de uva y no puedo
mandarla aca a una cuadra a que me las compre, o sea una mezcla de
autodeclarada incapacidad de ella y un poco el querer yo que no me
echen gran moco en las compras de ciertas cosas hace que no me sirva
para eso. (ya se... tendria que llevarla conmigo una vez y que vea y
luego a largo plazo ya que vaya ella.)

***** no es factible delegar cosas que son mayores o pq yo no me animo

como fue hoy ir a rapipago pq eran 20k o ir al banco menos, o bien pe
ir a poner un aviso que hay que preguntar por el numero de telefono y
quizas no lo logre y encima llueve.

***** no se presta y no es proclive a agregarse funciones en el dpto

pe me ve sacando la basura del cesto, atando la bolsa llevandola a
donde va poniendo otra bolsa, etc. u ordenando un poco el dpto asi sea
la parte del living cocina, o sea la parte dedicada a la oficina, y no
lo hace.

**** Creo que trabajo mucho :problemaTiempo:trabajo:
:LOGBOOK:
CLOCK: [2018-10-19 vie 11:30]--[2018-10-19 vie 11:37] =>  0:07
:END:
ayer a las 20hs ih escribe que recien se levanta despues de haber
vuelto del dentista y que se iba a acostar a dormir de nuevo hasta
mañana. Y yo pensaba que me habia levantado a las 7.30, no habia
dormido siesta, y recien venia de la oficina y eran casi las 21hs que
no iba a cenar, tome un "cafe" para despabilarme con cuatro pancitos
con queso para ponerme en la compu y luego me acoste con el celu en la
mano hasta las 23hs. o sea todo el dia con la cabeza puesta en el
negocio, pq nada de eso era personal, o sea qu een el fondo pienso que
estoy un poco excedido. Y quizas sea el formato de la jornada. Pero
tambien los otros formatos me han sido adversos tambien hay que
recordar. Y releer para verlo.

**** tag MALVENDIDO para ventas con errores concretos :programacion:idea:
:LOGBOOK:
CLOCK: [2018-10-19 vie 18:07]--[2018-10-19 vie 18:11] =>  0:04
:END:
se hace un log en comentarios explicando la foto en el momento como
estoy haciendo en org y se tagea como malvendido (puede ser un campo
logico ya sea en ventas o clientes ya se vera) la idea es que despues
podamos comprobar con ese tag cuantos pagaron y cuantos no. Y de paso
ir uniendo logs y creando una especie de instructivo que nos indique
cuales son los casos en los que no se debe vender. Pq en la situacion
actual de la base de dato todo queda en el olvido, se vende mal, se
borran los rastros (condonamos) no anotamos nada y despues si hay un
terrible incobrable no lo atribuimos a la mala venta.

*** 2018-10-20 sábado
**** estallido de fin de semana inexplicable contra ih :estadoAnimico:findes:ih:
:LOGBOOK:
CLOCK: [2018-10-20 sáb 15:14]--[2018-10-20 sáb 15:25] =>  0:11
:END:
Vine mal de la oficina pq  el dia habia terminado sombrio y estaba
beligerante en especial contra el Fede y ya ih se habia retirado de la
mesa y yo trataba de hablar con la Cami suavemente tratando de que
ella pudiera serme mas util, como habia expresado en post anteriores,
o sea poniendo como ejemplo la compra de nueces de ayer, que no pudo
hacerla pq no encontraba o no se animaba a encontrar el lugar, y yo en
un esfuerzo maximo de condescendencia, estaba proclive a llevarla
conmigo a que viera donde es y como compro para que pudiera ir ella
otra vez y asi serme mas util, y alli ellas dijeron que eso era asunto
privado mio que no tenia que ser pagado por el sueldo de romitex, y
que el Fede en todo caso le pagaba extra a la Cami por traerle cosas
del centro y entonces se mete la ih, y yo le dije "gorda amorfa" que
se callara y entonces quedo todo asi en la media ofensa. Y como yo no
me retracte y segui medio enojado, y hoy me pide que la lleve a alta
gracia a llevarle las plantas a la madre y a visitarla y yo no la
lleve entonces me siento mal yo y a la vez me da bronca pq me paso
toda la semana renegando por el puto negocio de mierda, y las cosas
que no funcionan y tener que venir el fin de semana un fin de semana
al menos que la Cami no sale y tener que empezar tan mal, ya cruzado y
con dos compromisos tan complejos que estan relacionados pero son
dificiles de sacar.

**** Cambio de sistema operativo :programacion:notebook:
:LOGBOOK:
CLOCK: [2018-10-20 sáb 15:28]--[2018-10-20 sáb 15:35] =>  0:07
:END:
Cambie dentro de Solus a variante Budgie, que ya la tengo en el
desktop y ahora la paso aca y me parece que esta muy buena pq no tiene
ese menu que aparece y desaparece al costado que es desconcertante y a
la vez es muy solido.
No hice encriptacion del disco entero pq ahora no estoy usando los
datos de romitex, salvo para la programacion pq trabajo con un
pendrive, y el orgblok lo tengo en un volumen encryptado en verycript
lo cual es mas seguro y a la vez facilita el arranque de la maquina y
el prestamo de la maquina. 
Tambien tengo telegram que tiene un pin de cierre en ambas maquinas. O
sea que mientras no estoy esta cerrada la aplicacion.
La instalacion fue muy rapida esta vez con las instrucciones que ya
tenia de la vez pasada.

**** buen resultado de este sabado :programacion:
:LOGBOOK:
CLOCK: [2018-10-20 sáb 23:57]--[2018-10-21 dom 00:00] =>  0:03
:END:
estoy muy conforme con el resultado de este sabado, empece y le di un
espectacular inicio al buscador del F13. Ya esta planteado el
problema. Ahora queda armarlo.
El lugar aca se presta con la nueva disposicion de la cocina al lado
del tele. mientras ih ve tele yo programo.
Un F13 nuevo va a resumir el F7 y el F13 viejo en uno nuevo.

*** 2018-10-21 domingo
**** consulta dentista :dientes:implantes:
:LOGBOOK:
CLOCK: [2018-10-21 dom 12:29]--[2018-10-21 dom 12:36] =>  0:07
:END:
ayer hice la consulta general al dentista sobre todos los temas que
tenia hasta el presente y hago este post para recordar.

***** amarilleo

dice que no amarillean facilmente y que pueden volver a lo natural con
bicarbonato o una pasta especial o una limpieza del odontologo cada
seis meses

***** bruxismo

placa de deporte que se remoja o bien hacer la placa especial cuando
tenga el turno el sabado 17/11 

***** pasta dental

la noc no es mala, pero tengo que comprar pastas que cuiden de la
encia, todas las que tengan mencion a encias ya sea oral B o sensodyne
o colgate, pero que tengan eso en la caja

***** cuidar sintomas

si entre el diente y en la encia se va formando una bolsita que se va
inflando se puede ir haciendo una infeccion con el implante

***** aftas

las aftas ovaladas se formaron con el cepillado y son mas persistentes
que las aftas comunes y pueden ser molestos y tambien sangrantes, y
pueden ser producidos por excesos en el cepillado.

***** masticacion

es normal por unos meses el tener miedo a masticar, pero no hay que
tener miedo y mas que yo tengo los dientes naturales abajo que me
permiten saber el grado de presion que estoy dando, pq con todo
implantado no se sabe la presion que se da. 

***** tic de empujar con la lengua

dice que no se aflojaran los dientes con eso

***** premolar mas atras

que se puede corregir un poco con el implante definitivo pero va a
haber un defecto pq la conformacion original de la boca era muy
deficiente en ese sitio.

**** Aprendizaje de emacslisp :estudio:freakismo:
:LOGBOOK:
CLOCK: [2018-10-21 dom 12:37]--[2018-10-21 dom 12:42] =>  0:05
:END:
Estoy leyendo el manual de emacs-lisp que aparece con emacs que lo
tengo en firefox traducido bastante bien. Y aunque no es algo que
lleve a una via concreta no deja de ser algo que va relajando en las
lecturas, idem el paso a telegram.
Tendria que pasar a teoria lo aprendido de ambos temas.

**** finde espantoso pero pasamos :freakismo:findes:ih:
:LOGBOOK:
CLOCK: [2018-10-21 dom 17:32]--[2018-10-21 dom 17:37] =>  0:05
:END:
Dentro de todo fuimos pasando, la relacion con las hijas salva todo,
dentro de todo con el FEde todo bien, dentro de lo normal, y creo que
no hice tan mal papel alla con los consuegros. 
Solo con mi freakismo informatico compartiendo tips de informatica
pero nada mas, y no mucho mas y sin querer resultar ofensivo ni nada.
No creo que todo sea para mal.
Me salio mal desde el viernes a la noche el relacionamiento con ih que
termine sacando chispas sin querer pq no lo tenia previsto y no se pq
lo hice, y creo que termine mal por eso a pesar de ser este uno de los
fines en que estoy excedido en la facilidad de uso de la compu, pq
puedo enchufar aca mismo en el mejor lugar y tener tiempo a
discresion. Y casi no se que hacer con todo ese tiempo, Y el freakismo
extra por fuera solo se canalizo suavemente solo a un libro  que es la
introduccion emacs-lisp, y lo de telegram. Que no se si ira a cuajar
del todo.

*** 2018-10-22 lunes
**** instale veracrypt en la compu del dpto :freakismo:findes:
:LOGBOOK:
CLOCK: [2018-10-22 lun 12:11]--[2018-10-22 lun 12:11] =>  0:00
:END:
ya tengo en la notebook y aca, faltaria en la oficina

*** 2018-10-23 martes
**** dia durisimo y largo :cansancio:trabajo:
:LOGBOOK:
CLOCK: [2018-10-23 mar 21:32]--[2018-10-23 mar 21:38] =>  0:06
:END:
hace dos dias que no duermo siesta.
El dia comenzo mal pq vino la Cami con la Romi a desayunar, pero
contuve la ansiedad lo mas bien, y seguimos adelante.
Pero hace dos dias que me saque la presion mental de "tener que"
dormir la siesta y eso es un gran avance que me quita ansiedad pero me
va acumulando cansansio.
Y en el fondo acumulo presion hacia el sistema.
No puedo ni quiero culpar a la Romi, ni menos que le va bien pq le
preste la oficina, pq esta segunda vez no se la voy a pedir ni la voy
a molestar.
Tenemos que buscar una solucion al sistema y esa solucion tiene que
venir de nuestro lado. 
Yo sigo motivado pero el cansancio va haciendo mella en mi, estoy
rompiendome fisicamente y lo siento en el cuerpo, en el cuello en las
piernas, en las pantorrilas por la excesiva cantidad de tiempo en la
maquina y sentado.
Y encima no como bien pq no tengo nada comprado y no estoy haciendo el
licuado, y ayer no se si fue el agua del pico o las empanadas me
agarro una mini diarrea que me complico las cosas.
Pero es la excesiva aplicacion al freakismo computacional, via
emacs/orgmode/elips este finde/ telegram/ programacion en tcl nueva
sumado a la crisis del sistema de cobranza y la crisis en general lo
que hace que no podamos vivir ni tener un respiro y estemos
practicamente viviendo para trabajar.

*** 2018-10-24 miércoles
**** :estadoAnimico:depresion:
:LOGBOOK:
CLOCK: [2018-10-24 mié 10:35]--[2018-10-24 mié 10:43] =>  0:08
:END:
hoy tengo un bajon enorme, a pesar que dormi bien me tome dos verdes
anoche luego de un arroz magro y me puse a ver un poco viking en el
celu acostado y luego leer un poco disperso y no me bajaba sueño, pero
me bajo la persiana y me dormi hasta las 6 que el vecino empezo a
hacer ruido y pensaba que me iba a desvelar, y me puse una SL y tire
hasta las 9am tronco, o sea tire 9hs tronco bien. 
Pero la Cami me avisa que no viene, y me levanto cansinamente, aunque
lave los platos y para desayunar dos pancitos me tire una hora y
media, debe ser que quede semiplanchado (menos mal que no me bañe pq
sino se me bajaba la presion), el moco que no tengo nada para comer ni
ganas de ir a comprar. Y en el fondo me borbotea una olla a presion de
la problematica de la falta de cobrador en relacion a tomar o no tomar
o sea a llamar a alguien por 100k de excedente nomas o sea un barrio
nomas, y unos extritas pq puedo reacomodar un cacho y no sobraria
nada.  Y tomarlo con mas calma. Creo que hare eso total tengo la
semana proxima el aviso de nuevo. Lo que pasa y no me quiero excusar
es que no dejan de ser hechos bajoneantes los que suceden que exceden
la actuacion de uno. Y no se arreglan tan facilmente como para que uno
quiera ahi nomas tomar riesgo para meterle adelante con un aviso y
captacion maxime que quiera o no en el medio perdi la oficina. (Repito
el tema no lo quiero tocar ni con ih, ni con el Fede, ni con nadie
para evitar filtraciones, pasa como con la Cami a principios de año,
pero es algo que te afecta en cierta medida.)

**** porque quiero renunciar a todo :trabajo:matetes:CE:crypt:
-----BEGIN PGP MESSAGE-----

hQEMAzw2XLrRDtSdAQgAtZ9jqlzD9WYLfYqX2LFpkqTC5tKaKXs4GP/gTcFezjXS
lvW0H3phQS/hz0AfYBkuLHl/QeMzc4wjNqMSGOt83NHMGjHNkxTcPeAlzDDHpvj1
0B6wUx1E7O6JDGChaQtH8HTfAyp7euRaR/BOvQLxWqV8RQtWtduwn1kyfGn42EEj
I3m3F1tw0yJGJtOQOxBHSnqObYqtxJsxQFtp/vKr4dAhDvxIqApLuh0ja9dF3sEG
villdPrtGaUsNqDKrPsfjjVL8H4Uo0VnVaBU8/bN9MfJmbzop9YA4F+10RWF2Ql0
rzVJLK9+OtBwWm/R/9I79mAQU8jTvAhwrxY7nkix+dLqAQsAZ85yJLxBqZw4Haw7
GIg5y2uFrWWmjbvwije7E/2928vL3WvJrt2F7YvCkh1H+bKzLPgMGErduCP28T8I
61Plj3/421o2wVlx8Kz+qRa/31OCZMK8ZkpiFQfQb6hOj7v9G2gQYCNKw9eJGrPR
C28zH/6mUT/d5FilQsBO+lTcbs43ehzck7H8jXAkZv9Z+07G98sqhYQjxV1UdUcc
4QKMlgzVwONt0hinC07jZh0wKHfPfvakdslAEhgDbLmYmChHP3dGQy4A85fB+df7
suAhTV14zqy5wKBs7w9IKN6h98y3gWimWM1wFo0jQiHDWU+vgtRtkdapy9zY5Lzp
OK30DhTc6ZqaEBIDrIDMHHtIeQ7K8pgaV4TMuQyUmrQdzQ8kIKsNAjuaT6p6eS1g
oghK+x2ct1ANaFm3pGiDQpCjJi0qDMWZlRhoTkaKy04Ly19FBpvIUxiePUgLOBof
VWuaZ5gQ3KXJyY182es1Yi8W1Sz5BZgj4HGS3vAgVmHnpP4Hg8TA8hRPRHYplxbl
J8q2qOFNg1Z6ihZVBmGkUoeGPn07b6FVr4OQdmt+N/UkCAX3fwvUnJSSWT/71gP5
E9iwnogZsIHeQkfOawo+f5GuhU8ycAb0XZjZF+Ux1jLUrImZwy9eVFLTJbjXtQX4
Q8b1U1GKSMqCj64VO42CfIWOU2vcdU3n+O/t8REaLkPHO6lIB/9bwjrPyocz8YHw
SR8JdxBMYtvpD6FguWRKTptk91r0ZsbTElt/4iKKvBhGeb6yx9EhG5SxGnTFs8pL
lgXLJumNoigsXc5tgcV27rhPutFeAOfj2Lffwj3+WgwWfx4WoJeTP0WgELMwW63d
1lGIEqE6Eq6rKtwc8IvSWJS2UCaMb9xzBfvmcRM66S3BlLGr12w8S1tUSQSYkzZS
PBQRfQlpL2wf+x0O5P0jSQWMOtfvrctRYzpHSQZ5WqJdqmiYmEkEvzsxlbyIaG1P
IlyOWeO50MgH01dF72Z4VCzrIwLcZVU60mggWftKwsoMXl5/Sln9Yk5MNwdjMyOz
v93zQwe+h7svyvrmsdFYD/v4mjR7L3NXm9cS+ecUuNn5qyhjZzm85EurgqCUbvwt
oFAR9DToo9R8SpfL3ejNkcPKsfCMlsPL4FIj1IFWEU+2gZ0GvQ5UGkZ1hP5lrFZa
NiqOrp5Ns/8gYhQL05xW/3Bnb6HGQIhav8w749H86OSNBSvwio/tkVWUY8ur0W4m
aLQp00eCOx/Sy/T5Qp4cbkyagj8NOceqg3UqvIM+SJ27VDOrIDqyqhG/HT/XeLRj
7E02HJGF27OHSP0a3GZKwUSluHGVhy8+APB3MPZB6itqZnZLF79zfM/4kKfyw+rl
YqIq3TEdM2OXFtpdvyzAFjSX0orVlos9uRW4tzS6FOgLPGJ0v4JU1oQt41xhvrXn
c1bxEYnHMSriqqUrJpJcjwwgudiJ+yhkDyQvFByTnQ5NynHEgZrKrPLrs76Itbmh
qU69Ro3sGfbcw27WLK4HJwmDCPeeeFko6w9bTlJllx7mvMa0WiDGZ7Od/rv5FUni
JVaXUN/KcFeIxIz4JzDgRxURhG0=
=4CyR
-----END PGP MESSAGE-----
**** hoy falto la Cami y fue caotico :ansiedad:estadoAnimico:
:LOGBOOK:
CLOCK: [2018-10-24 mié 16:26]--[2018-10-24 mié 16:27] =>  0:01
:END:
me mata que no venga, son las 4.30 y estoy destruido, y no he
terminado y tengo entrevista a las 5.30
y no comi bien y es injusto que haya faltado. Y tampoco me gusta que
venga, esto no tiene solucion va camino a terminar mal.

**** Estoy preso de un esquema que no puedo dejar :libertad:
:LOGBOOK:
CLOCK: [2018-10-24 mié 19:29]--[2018-10-24 mié 19:39] =>  0:10
:END:
hoy fantaseaba por un rato sobre unas vacaciones o un retiro mas bien
sin plazo de retorno, donde podria tratar de desestresarme y dedicarme
a mi mismo pero eso seria casi imposible pq en realidad no hay
posibilidad de que ello ocurra en la practica. 
¿Como haria que la preocupacion no me invada a la distancia?
¿Como haria para no caer en conductas autodestructivas y no caer en
algo peor de lo que tengo ahora mismo?. 

Pero en realidad que el cansancio que tengo ahora sumado al estado de
abandono total en que me encuentro hace que caiga en un estado de
desesperacion que me hace mal. La jornada se prolonga y se hace
interminable y luego llego a la casa y no tengo que comer, y se que
mañana me tengo que levantar para una jornada que se me va de las
manos en una forma tan rapida que no se como explicarlo y luego
tampoco tengo que comer al mediodia, y tengamos en cuenta que no tengo
licuado. 

Y tampoco tengo siesta pq no se en que momento me quede sin siesta.
Y en que momento necesito unas dosis tremendas de clonazepan para
dormirme y mantenerme dormido durante la noche. 

Y el fin de semana es caca. Pq no arregla nada pq estos dos ultimos
findes que podrian haber sido disfrutables por el clima y pq la cami
no salio se arruinaron por la presencia de los parientes y sus
desencuentros y por la rutina en general que ya describi en otro post
mas arriba.

*** 2018-10-25 jueves
**** necesidad de vacaciones- posibilidad :estadoAnimico:depresion:
:LOGBOOK:
CLOCK: [2018-10-25 jue 08:21]--[2018-10-25 jue 08:46] =>  0:25
:END:
Bajando a lo mas concreto luego de ayer otro dia duro en el trabajo
creo que podria aspirar a un periodo de descanso normal y ver que
pasa, tratar de desenchufarme en la medida de lo posible (si es
posible)
considero algunos puntos para ir viendo:

***** que Fede tome contacto con el crudo de los cobradores

anoche vi como vengo viendo estos dias pasados que de 815/816 entra
una descripcion cruda de las cagadas de la calle, casos Olmedo, o ayer
el del lavadero de la tercera con tres ventas alli, junto con casos
que no te lo cuentan en crudo con detalles pero lo mismo no se cobran
en jid1 o en estacion flores que te das cuenta que estas frente a una
cagada de dimensiones epicas.
Esto tiene que escucharlo Fede directamente el por un tiempo.

***** Fede atiende oficina

Esa seria la base del arreglo de las vacaciones.

***** Cami pasa papeles en marques

pq no daria ni que lo haga en la oficina ni que lo haga en el
dpto. Esto seria un punto en contra que me rozaria mi tranquilidad si
mi descanso pienso pasarlo en el marques, pero lo mismo puede ser en
la oficina de 3 a 6. y tenerlo todo hecho antes de que venga fede.

***** Yo quedo librado de mis obligaciones nominales

que serian papeles y atencion al publico y atencion de cobradores por
wapp (en especial Fabian). Y faltante de cobradores, etc.

***** Quedo con algunas mini-obligaciones y algunos asientos

Por como arreglaremos el tema caja de ahi en adelante. 

***** Duracion

Hay que considerar un plazo largo minimo de un mes y si es posible dos
meses. Estaria dispuesto a ganar menos.

**** porque convendrian los cobradores a pata :trabajo:
:LOGBOOK:
CLOCK: [2018-10-25 jue 15:07]--[2018-10-25 jue 15:26] =>  0:19
:END:
el problema mas grande de los cobradores motorizados es que si bien es
cierto que son comodos y dan previsibilidad (aprenden a hacer la
funcion y son durables, ver por caso 516 o 750) y si tenes suerte
tienen una salida honorable, no tienen la flexibilidad de los
cobradores mas chicos pq siempre tenes que asegurarles la
rentabilidad, y aunque eso lo tenes que velar por todos es mas
acusiante en el caso de los motorizados pq tienen costos mas altos o
pretenden ganar mas.
Y ya desde la epoca de la Elba que habia quedado sorprendido que con
dos Lucianos a pata hacia una Elba, y ahora viendo en retrospectiva
los registros con dos lestas o con un nir y una lesta o un cocoliso y
una lesta hago un pablo, un poco ves que la enorme flexibilidad con
que contas con la dupla cocoliso/lesta no tiene nada que ver con el
pablo por mas que sea un pibe que siempre te vino. Ni hablar si lo
comparas con otra moto menos eficiente o una moto baba helada como
801/809/804 o problematica como 813/817 etc. Pero hay que tener tiempo
y hay que estar bien de la cabeza. 
Incluso se podria hacer desde el comienzo sistemas de control, como
enviar ubicacion por wassap al comienzo y final de la planilla y
planillas de visitas de clientes. Entonces eso aseguraria que hay buen
trabajo de entrada. 
Sino ocurren cosas extrañas como esto que 802 cuenta que te hace 60
fichas de yofre en 3 horas. 

**** adelantos sobre el plan B :trabajo:idea:
:LOGBOOK:
CLOCK: [2018-10-25 jue 15:26]--[2018-10-25 jue 15:27] =>  0:01
:END:
creo que no estaria mal la idea pq aunque uno perderia esa
exclusividad en el fondo se iria a un sistema serio y en lo posible
mas eficiente y que demande menos de nosotros como personas.

*** 2018-10-26 viernes
**** Cual creo qu ees el problema de Romitex:trabajo:idea:
:LOGBOOK:
CLOCK: [2018-10-26 vie 12:28]--[2018-10-26 vie 12:56] =>  0:28
:END:
un esquema cero tiene el ojo del amo sobre unas cuantas cuentas que
domina y maneja a ojo, (p.e. Fede en el Chaco, o Fede aca en Cordoba
con Villa los Llanos, fragueiro y liceo), incluso un esquema
unipersonal 24/7 como el mio con el Romitex pre2006 podria decirse que
manejaba todos los hilos con bastante tecnologia. 
Y ahora ¿Cual es el problema?: que en los ultimos dos o tres años,
demandamos cantidades enormes de tiempo personal en gestion,
principalmente de cobradores (captacion, manejo, pasado de papeles,
etc.) porque la parte venta no se podia dejar aparte y a la vez por
causa de la sociedad necesariamente crecio la cantidad de operaciones,
y todo se monto sobre la fragilidad casi de los mismos programas y
tablas y sistemas del pasado, se podria decir que incluso a veces
menos que en el pasado. 
Y como el negocio crecio y se expandio y dejo de ser monolitico, y
tuvo problemas (se desorganizo por causas externas: pongamos por ahora
solo el tema de el pasado de papeles por la Cami y el tener que
abandonar la oficina como centro de funciones unificada) terminamos
con un "sistema informatico" debil para enfrentar el nuevo
desafio. Trabajamos con algo obsoleto, con algo viejo que no cumple
todas las funciones, que no es seguro, que no nos entrega informacion.
En parte es debido a que no se le asigna importancia a los datos, y yo
tambien ante la rutina del dia a dia, el enorme cansancio y hastio, el
ver que la noria sigue girando sin fin y sin esperanza, no encuentro
nada que me guste en el horizonte. Aunque percibo de entrada que el
sistema es lo que cambiaria el futuro, o sea un rediseño de cero de
todo el sistema. Y para eso tengo que trabajar tranquilo desde cero en
forma enorme. Pero alli tendre que definir que quiero escribir o que
sistema queremos escribir. En ese caso tiene que ser algo para todo
tipo de usuario y flexible para todo cambio futuro.

Resumiendo el problema de Romitex ha sido que nos hemos agotado en
funciones comunes, pq no podemos delegar nada, pq no hemos creado
sistemas seguros que funcionen bien pq son parche sobre
parche. Todavia dependo de un fichaje.py seriamente achurado para que
siga funcionando pq no he reemplazado todas las funciones, y tengo
programas viejos y programas nuevos, y no tengo estadisticas fiables
en ningun lado. Ni tengo sistemas de auditoria confiables ni nada. O
sea todo debe ser muy hecho a mano para que no falle. 

Y en el medio personalemente aparte de los problemas de agotamiento
que tengo, y que hace mes y medio o algo asi que abandone todo por el
tema tecnologico, por ahi me disperso en otras areas (mas alla de las
herramientas como son org/emacs que habia que recuperarlas y
perfeccionarlas y eso estaba bien), pero hay areas como lisp que no
tienen nada que ver con el futuro de una posible solucion al tema de
la programacion que necesitamos, pq necesitamos una programacion de
escritorio y esta hecha con tcl/sqlite y no vale la pena salirse de
ahi. Todo lo demas ha sido basura, incluso python fue basura pq la
mayoria del tiempo invertido fue para emular las herramientas que en
tcl tenia en forma nativa. Sin ninguna ventaja significativa arriba de
eso para construir algo que valiera la pena el cambio. O sea que en
ese sentido creo que si algo debo hacer es dedicarme a fondo a esas
herramientas y a ese proposito.

**** transcurrio mi ultimo dia de oficina :trabajo:bitacoraOficina:
:LOGBOOK:
CLOCK: [2018-10-26 vie 20:01]--[2018-10-26 vie 20:03] =>  0:02
:END:
y con lo justo llegue a cumplir con mis funciones.
y dejo la posta a los demas. 
todo pasa y ya es hora que haga otra cosa. 
Estoy realmente cansado y me merezco un largo descanso si quiero
recuperarme en todos los sentidos. 
Porque se pierde un monton de todo.

*** 2018-10-29 lunes
**** Primer dia :retiro:estadoAnimico:
:PROPERTIES:
:CREADO:   [2018-10-27 Sat 18:56]
:END:

Vine rapido y bien.  Charla breve y fluida.  Almuerzo bueno y sin
sobresaltos con las chicas Larga siesta.  Solo el dia esta tramado por
la obligacion de ir al evento que tengo llevar a la Cami.  Fui a
llevarla facilmente pq era cerca y no habia transito pero fue muy
larga la espera y luego la noche fue caotica mas que lo comun.  Mas
alla de ello en este primer dia tuve expresiones bastante
desafortunadas que pienso q provienen de la desesperanza y la
depresión y la ira mas q todo pq el estado de agotamiento de los
últimos dias no me permitio explicarme claramente en mis propositos.
Nadie sabe q quiero hacer y como yo necesito descansar mas q nada y no
veo por momentos la posibilidad de un espacio fisico de tranquilidad
para hacerlo entonces me pongo agresivo.

**** Algunas cosas q se cruzan
:PROPERTIES:
:CREADO:   [2018-10-26 Fri 16:41]
:END:

Matetes De como me cambio la vida quedarme sin auto y eso no se
compensó con haber comprado la casa ni haber vivido en dpto Que haber
tenido q vivir en jujuy me mato por el ruido Que la oficina me mato
por la falta de tiempo en q me sumio Que retirarme ahora supuestamente
a descansar es un peligro para mi pq cedo la unica porcion de poder q
me queda Que creo q me tengo q recuperar en silencio de a poco.  Pero
los problemas q basicamente tengo no van a desaparecer.  Quizas veo
todo muy malo pq estoy cansado.

**** Segundo dia :retiro:estadoAnimico:ansiedad:
:PROPERTIES:
:CREADO:   [2018-10-29 Mon 11:39]
:END:

El domingo estuvo tramado por no haber podido dormir bien la noche
anterior y por los compromisos inflados q tenia
- correr los muebles
- ir a la oficina
Y luego todo se esfumo. El corrimiento de muebles fue 5 minutos y el
ir a la oficina no fue tan grave. Pero lo mismo no dormi bien por los
gatos pienso en especial el escli y pq el lunes empezaba la obra

**** tercer dia retiro :retiro:migraña:hijas:
:LOGBOOK:
CLOCK: [2018-10-31 mié 19:34]--[2018-10-31 mié 19:35] =>  0:01
:END:
Hoy al final me levanté a las 9. Salude a los albañiles. Pedi el
contenedor. Todo fluido.  Y fuimos a ver a los bancos de la Romi Muy
lindos y muy contento q se vaya para arriba y q la pueda ayudar Una
migraña de 2 migrales antes de las 12hs me molesta pero no es por
ansiedad.  Medio a la madrugada. Medio al levantarme y uno al volver
de ver los bancos.  Otra tarea q estaba agendada y ya la hicimos.
Hasta las 19.15 sigo con migraña.

*** 2018-10-31 miércoles
**** gran ataque de migralosidad :migraña:
:LOGBOOK:
CLOCK: [2018-10-31 mié 19:37]--[2018-10-31 mié 19:37] =>  0:00
:END:
 ultimos dias de octubre con gran migraña, tres dias seguidos de ataque
 de migraña algo increible y no se puede explicar bien. Solo por el
 deseo de descansar de salirme un poco de los problemas y terminar al
 final con los mismos problemas o ansiedades de siempre.
 Fueron dias muy caoticos se sumaron asquerosamente una sobre otra las
 cuestiones sobre mi cabeza sin poder sacarmelas de encima. La obra en
 la casa, la delegacion de la oficina que todavia no fuenciona bien, y
 que tiene en si una cola que es que la la ih esta fuertemente del lado
 del Fede pendiente de su supuesto sobretrabajo y en el medio la Romu
 que inagura el nuevo emprendimiento y tenia un par de compromisos
 pendientes por ese lado. Y la cami que el sabado tenia un compromiso
 que no podia faltar que era mayor a los habituales y en el fondo
 terminamos peor que lo normal.
 Al no poder salirme para irme de viaje o descansar de alguna manera
 esto no me sirve de nada, pq no me permite mejorar mis nervios ni mi
 salud ni mi ansiedad ni nada, solamente al ver como reacciono mi
 metabolismo puedo darme cuenta que fue peor el resultado que haber
 seguido como estaba. Siete migrales y un cortipiren (hasta ahora) en
 los primeros tres dias habiles que falto, una cantidad que no sume de
 ansioliticos que calculo en una tira entera, no menos de 4 por dia, y
 sintomas varios de todo tipo, no son buena señal que la este pasando
 bien. Las dos migrañas de ayer y anteayer fueron fuertes y largas como
 las de un post-tratamiento de 6 a 8 hs de incapacidad total, y con
 dolores casi totales, y la de hoy amenazaba con ser igual a las de los
 ultimos dias.

** 2018-11 noviembre
*** 2018-11-01 jueves
**** un embole que ya casi paso una semana y no tengo nada :retiro:
:LOGBOOK:
CLOCK: [2018-11-01 jue 17:48]--[2018-11-01 jue 17:52] =>  0:04
:END:
Hoy es el primer dia que casi equilibro, casi se puede decir pq en
realidad la realidad dista de ser sana kilometros, o sea estoy
mantenido por respirador artificial agravado que seria la programacion
para no caer en lo peor de lo peor que seria una depresion gigante con
todo, Ya el desmejoramiento fisico es terrible, yo lo noto, o sea solo
al verme al espejo me doy cuenta que estoy hecho un espanto y la
situacion actual me esta sobrepasando mucho. Por eso espero que esta
semana de menos obligaciones sirva para que se calme el dolor de
cabeza y se calmen los nervios y logre la paz.

*** 2018-11-02 viernes
**** a casi una semana de dejar de trabajar :retiro:
:LOGBOOK:
CLOCK: [2018-11-02 vie 14:11]--[2018-11-02 vie 14:46] =>  0:35
:END:
el balance es caotico. Y me empieza a dar miedo.
Ya empiezo a ponerme paranoico y no confio en nadie en serio.
Si antes decia cosas por decir ahora creo que van en serio. 
Es cierto que ha sido una semana caotica para todos. 
Los albaniles en casa deben haber sido dificiles para ih tambien y
ella tenia que ir si o si a ag antes de manana. Y logro ambas cosas y
dentro de eso no tenia tiempo para nada extra. Que yo decidiera
salirme de trabajar de repente sin preguntar que cosa la mia.

la Romi en lo suyo, la Cami en lo suyo, y el Fede aunque seria el gran
sacrificado para permitir que yo me tome un descanso, el mas bien lo
esta viendo para salirse de la calle.

Lo que mas me afecta es el estado nervioso que tengo y la falta de
posibilidad de hacer pie para volver a reencausarme en un nivel
apropiado de fuerza para volver a ser funcional.

pongamos como ejemplo ayer.
Digamos que luego de abortar la migrana antes de ayer o sea miercoles
luego que el gran compromiso de llevar al lolo quedaba tacitamente en
la nada y quizas mas concretamente pq me habia tomado un cortipyren.
Luego como me puse a programar todo fue mas o menos bien hasta me
dormi sin tomar ansiolitico.
Me levante y tenia que ir al banco y a pagar el alquiler, me habia
banado el dia anterior y tambien iba a ir al peluquero (que en las
circunstancias que estaba viviendo era bastante dificil), no obstante
hice todo bastante rapido y bien, fui al banco, pague el alquiler, fui
al peluquero, y todo iba bien incluso programe un poco, cuando vi que
ih subio la foto que habia limpiado la casa, y como yo no puedo hacer
vida independiente alla, primero pq no estoy en una situacion digamos
para abreviar de nirvana (o para abreviar mas nirvana beligerante) si
no vengo empiezo a tener ansiedades o sea ansiedades por estar en
falta de no venir, o por no venir entonces, ahi pienso en venir y le
mando mensaje. Y en ese eterno desencuentro estaba, cuando me llama el
Fede que me pregunta donde estaba y me propone que me traia el, y de
ahi, en ese momento que eran las 18.05 hasta las 19.30 que mas o menos
habra venido me tome dos SL, me empeze a poner mal, y quede hecho un
trapo de piso, recien cuando estabamos llegando aca me empece a
normalizar.
(Hay que notar el porque quizas de todo, quiza sea pq en el fondo ya
no me queria quedar en el dpto pq ya estaba hastiado y me queria ir, o
pq no me gusta esperar, no me gusta estar esperando a que me lleven,
solo para ahorrarme un taxi, etc. Esa hora al pedo total ahi en la
casa donde no podes hacer nada pq en cualquier momento te caen es un
embole, y encima, a los minutos nomas, parecia que iban a cortar la
calle y que el encierro iba a ser total, luego de haber quedado
desequilibrado, venir en la kangoo, que siempre me pone nervioso, "ser
traido" -"El mundo al reves yo tengo que esperar una hora para que me
'traigan' al marques e ih se va sola con el bora llevando a su hermana
a alta gracia!!")
Esta inestabilidad es lo que me friega totalmente. O sea el estar como
inestable nerviosamente.
Y no tener una base de lugar donde estar.

**** bases del plan :freedom:
:LOGBOOK:
CLOCK: [2018-11-02 vie 14:49]--[2018-11-02 vie 14:52] =>  0:03
:END:
lo primero es lograr un cambio en la mente.
no puedo recuperar nada sino me estabilizo animicamente.
debo solucionar el tema nervioso
y desde ahi ver como recupero todo lo que es mio

**** Resurreccion :OBJ:freedom:
:LOGBOOK:
CLOCK: [2018-11-03 sáb 09:02]--[2018-11-03 sáb 09:02] =>  0:00
:END:
 1. Aislacion nirvana atomico
 2. Rutina sana
 3. Comer mas sano salir de la anorexia nerviosa licuados y licuados
    verdes.
 4. Ejercicio progresivo
 5. Comenzar por un libro solo propongo louise hay
 6. Estudiar a fondo tcl programacion para q la solución a los
    problemas q se vayan presentando en la programacion sean resueltos
    a fondo p.e. como ahora reempeze a estudiar listas y todo lo
    relativo a ello pop push qeque

*** 2018-11-03 sábado
**** Comentarios sobre el plan :freedom:
:LOGBOOK:
CLOCK: [2018-11-03 sáb 09:03]--[2018-11-03 sáb 09:16] =>  0:13
:END:
Creo que anoche me convenci de tres cosas:
1. voy a salir de esta situacion
2. voy a salir solo
3. no puede ser aca

O sea me creo capaz de generar dentro de mi la fuerza para curarme una
vez mas de la situacion que me llevo a estar asi como estoy. Y cuando
me cure voy a estar mas fuerte.
Pero lo tengo que hacer solo, nadie lo hara por mi, ni nadie
comprendera mi problema.
Por lo cual no puede ser hecho aca por mas que parezca que aca es
lindo o que es agradable.
En cierta forma lo es pq tiene hasta cierta hora el aire de la manana
en la casa, pero ojo siempre encerrados en la casa, y en una rutina
dependientes, sin hacer nada positivo, para eso me plantearia ir
saliendo del marasmo atomico que estoy e ir p.e. desayunando en
distintos lugares temprano leyendo el diario, o cosas similares. 
En realidad yo veo esta alternativa como mejor a la otra pq veo la
otra a la luz de lo que yo-puedo-hacer-con-la-otra o sea lo que me
esta permitido. O sea como vivo al pendiente de aca o de ih ya sea de
las obligaciones o de los compromisos, no vivo una vida libre de hacer
y ser lo que yo quiera entonces alli es donde el dpto y la vida
alrededor de el empieza a carecer de valor.

**** falta de precision del status actual :retiro:CE:estadoAnimico:
:LOGBOOK:
CLOCK: [2018-11-03 sáb 13:10]--[2018-11-03 sáb 13:24] =>  0:14
:END:
no me pongo de acuerdo con las personas del entorno en cuanto a que es
lo que tengo y que es lo que estoy haciendo y que es lo que necesito,
entonces ante la falta de escucha, me pongo innecesariamente
beligerante y suelto frases como que arreglaremos por las buenas o por
las malas, o me ire y luego volvere a ajustar cuentas u otras peores
que les dije a las chicas no relativas a ellas sino a los
otros. (siendo los otros los que las perjudicarian a ellas y a mi.)

Lo que queria expresar era que necesito un descanso de recupero y
todos toman posiciones que me impiden descansar, nadie se pone de
acuerdo conmigo en forma amable para facilitarme el descanso, y al
contrario ni siquiera me permiten hablar. 
Y me siguen sumando obligaciones y compromisos y percances que cada
vez complican mas mi situacion.
Haciendo de un simple descanso algo caotico y desastrozo y una
situacion en la cual pensar que todo se va al carajo y que uno tiene
que protejerse y pensar en como va a sobrevivir. O sea nada mas
alejado de una situacion de descanso y paz que esta. Donde se activan
los peores temores y las peores situaciones.

Esta manana tuve la ultima posibilidad de hablar con ih y la
conversacion termino en la nada mas absoluta, hablar con una pared con
una mente vacia, hueca, con alguien que no te comprende ni quiere
comprenderte, pq el problema es que todos se estan posicionando y
nadie puede escuchar libre de situacion.

*** 2018-11-10 sábado
**** preparando la vuelta :retiro:
:LOGBOOK:
CLOCK: [2018-11-10 sáb 12:56]--[2018-11-10 sáb 13:13] =>  0:17
:END:
Luego de un retiro de una semana llego a algunas conclusiones que es
bueno registrar rapidamente como vayan saliendo:
.1 en los ultimos dias me distendi fisicamente, descubri que lo que me
hace mal es la mesa y obvio el exceso de compu, pero pare un poco los
nervios.
.2 creo que es muy nuevo para decirlo pero la pastilla de ayer dio en
la tecla de como parar la tension interna pq en cierta forma mas alla
de que nada cambio ni fisica ni mental ni situacionalmente, la toma
del quimico me saco el liquido que corria y me quemaba por dentro de
los huesos tranquilizandome sin ponerme zombi ni darme
sueno. dosificada en una sola en el dia, media cuarto y cuarto y hoy
comence con cuarto.
.3 sobrepase la gran frustracion de no dar pie con bola con snit y
luego con itclnuevo, con eso perdi domingo a la noche, lunes martes
miercoles. y parte de jueves no se.
recien anoche viernes a la noche cuando leo pausadamente el manual de
itk entiendo realmente la diferencia del objeto .t creado por tbls .t
que tiene el metodo .t llenar siendo llenar un metodo y .t.tbls
rowconfigure siendo rowconfigure un "comando" de un componente del
objeto .t o sea que no se le puede pedir ni a palos que .t tenga como
propio el comando (que seria el metodo) rowconfigure como para
ejecutarlo el mismo, seria un quilombo, esa confusion mental la tenia
hasta anoche, imaginarse cuanto tiempo estuve en la nebulosa
peleandome con el sistema, el cual lo hago andar pero sin tenerlo
claro, igual con las opciones. No se si llegar a este conocimiento
actual vale la pena haber pasado por lo que pase, o sea haber perdido
tiempo en todo lo que perdi, y haber ensayado lo que ensaye, y esto me
hace apreciar lo que tengo, que dentro de todo asi como esta va una
luz. 
.4 luego retomo el desarrollo del buscador guiandome por lo que estoy
requiriendome en el cuaderno y por ahi me voy de nuevo a la mierda
como cuando quiero modificar el alma de nemethi para que incluya mi
combo modificado en la edicion del tablelist, lo cual no se si es muy
necesario o muy seguro, o muy deseable perder tiempo en eso.
.5 dentro de todo un par de ideitas nuevas las pude pasar al toque a
lo nuevo como sumar celdas, o combo que filtre por lista de cajon, y
me permitio apreciar la rapidez que tiene el itk2 con relacion a
cualquier otro sistema que no se porque es tan lento. 
.6 la bocha es que me calme creo animicamente, y me di cuenta que debo
hacer algo con el dolor de cabeza pq no puedo seguir asi tomando dos
migrales por dia.
el licuadito diario, me regularizo el vientre joya, y con la pastilla
dormi muy bien estos dias, pero quizas exacerbo el dolor por el exceso
en la programaicon y los nervios, fruto del descontrol.
No me debo olvidar que pocos dias atras hablaba de matarlos a todos, o
matarme yo o irme a otro lado y perderme, ya ahora pienso en volver a
trabajar, en retomar una rutina sencilla, en volver a programar
simplemente y tratar de vivir sencillamente.
Creo que la crisis nerviosa que en cierta forma tenia y me parecia
enorme e inmanejable me parece ahora superable con la ayuda de una
pastillita y quizas sea el efecto de la chia acumulado, o de dormir
bien tambien, no podemos negar eso. LLevo durmiendo bien unas cuantas
noches.
.7 tendria que volver a mi casa para ver si puedo agregar otras
funciones a mi vida como serian:
   .a mas suplementos y comida mas sana
   .b mas movimiento
   .c ver si puedo dormir igual alla
   .d moderar la programacion como trabajo y no como obsesion
   .e participar del trabajo sin nerviosismo
.8 quedarme mas tiempo aca seria peligroso pq caeria en la dependencia
y caeria en mas conducta de dejadez. y a la vez no podria hacer nada
relativo a ir mejorando otros aspectos de mi vida o sea recuperarme.

*** 2018-11-11 domingo
**** items no negociables :retiro:trabajo:
:LOGBOOK:
CLOCK: [2018-11-11 dom 14:51]--[2018-11-11 dom 14:58] =>  0:07
:END:
noto que si no puedo expresar las ideas rapidamente en forma
coordinada y clara me pongo nervioso y alterado y que si hago un
esfuerzo de sintesis y aclaracion de ideas me tranquilizo.
Aca un resumen de las ideas que me parecen que son basicas de lo que
quiero

***** debo trabajar

no puedo dejar de trabajar ni pensar en ninguna otra cosa rara

***** me conviene seguir en la sociedad

por cuanto si no veo en perspectiva un cambio de rubro mejor seguir
con este negocio

***** necesitamos alquilar una oficina

ya que la oficina actual es indisponible, y el dpto no es apto para
oficina pq es mi vivienda personal y me gustaria disponer de el cuando
yo quiera.
la oficina pienso que debe tener minimo dos ambientes ser apta para
flujo de gente y posible venta a traves de promotores desde la oficina.

***** una vez instalados en la nueva oficina

o bien vuelvo a mi tarea o bien puedo hacer la tarea de la calle.
ya sea visita de clientes o grupo

***** no creo que la kangoo deba ser entregada a nadie

la venta base que nos asegura el sustento la debemos hacer nosotros
mismos.
Maxime en un contexto como el actual.


*** 2018-11-13 martes
**** Hoy comienza desafio :retiro:programacion:problemaTiempo:
:LOGBOOK:
CLOCK: [2018-11-13 mar 08:37]--[2018-11-13 mar 08:44] =>  0:07
:END:
Ayer llovio, y vino el Fede y se quedo hasta las 17hs aparte me habia
levantado retemprano para ir a arreglar las cosas a la oficina, y
quedamos que yo queria programar. 
Creo que debo programar con tiempo y esfuerzo lo que falta programar,
lo que tenemos que tener y que no se hara si no lo hacemos como un
trabajo. 
Yo se que si me adscribo a una rutina de trabajo light y sigo como si
nada puedo volver a una vida comoda pensando en mi mismo y en mi
patetica vida, pero esto es como ponerme a fabricar botes para hacer
algo, como Floky.
Y me produce ansiedad y problemas, y dolores, y a veces pienso porque
me meto al vicio en camisa de once baras pudiendo estar tranquilo
cumpliendo lo que debo hacer y punto. 

**** gran ataque de migraña :migraña:ansiedad:
:LOGBOOK:
CLOCK: [2018-11-13 mar 17:22]--[2018-11-13 mar 17:39] =>  0:17
:END:
Hoy tuve un gran ataque de migraña. Inesperado totalmente.
Ayer tuve un dia que se podria considerar premonitorio a una migraña,
pq tenia todos los ingredientes para ir preparando una migraña marca
cañon.
Me levante recontratemprano con una obligacion total de ir a
solucionar un problema de oficina, y dentro de todo estuve bien, la
medicacion funciono se puede decir, me senti normalizado, o sea me
senti bien, como me habia sentido esos dias previos en la casa cuando
dije que me habia sentido bien, osea viernes sabado y domingo, cuando
me senti relajado, y oh casualidad los tres dias que empalman con
ellos o sea sabado domingo y lunes curse con medio migral.

Luego que paso todo la mañana siguio mas o menos normal, y viene Fede,
y a pesar del encierro que significo estar en el dpto hablando con el
humo del cigarrillo y dando vueltas el mismo tema, se iba pasando la
hora del almuerzo y temia que me afectara a nivel dolor de cabeza pero
no, ahi le propongo que comamos algo y vamos por empanadas, comimos y
seguimos hablando, luego se fue a las 17hs, en el medio ni una señal
de migraña ni de un ligero dolor, luego descanso un poco y me pongo a
progrmar pq supuestamente habia quedado contento porque me iba a
dedicar a hacer lo mio, y luego sigo progrmando hasta que me dolian
las piernas, luego a nivel noche, temprano dudo entre que me empezo a
doler un poco y no sabia que tomar, me habia tomado medio migral, y no
sabia que hacer, y opte por quedarme en el medio y cene solo el
licuado, y pense que si tenia necesidad me levantaba y tomaba lo que
faltaba.
A todo esto la pastilla ayer funciono perfecto. Y dormi perfecto, no
me desperte y no tuve dolor, Me desperte bien, solo con leve dolorcito
y me desayune medio migral, el cuartito de pastilla y un beroca y me
hice un cafe con galletas, y empezaron los nervios a pesar que me puse
a programar, y a pesar de que tengo la camara para ver en vivo las
cosas.
No se porque me puse mas nervioso de lo normal, y deje de ver el vivo,
y me tome otro cuarto, y empece la escalada de migral con dolor en
avance hasta llegar a las 12hs con 2.5M tomados y una migraña cañon
que me tumbo, y al comienzo me acoste en el oscuro con celular
atendiendo y despues bloquie wapp y luego puse silencio. Me tome 4mg
de Cortipyren, y lo mismo me duro hasta las 16hs la recuperacion. O
sea tomo 4hs de incapacidad total. Me levante me bañe y luego sali a
pagar las boletas, y aunque el tramite estaba bien acomodado pero a la
vez era grande, tenia un nerviosismo que sobrepasaba lo normal, o sea
estaba fuera de control, o sea se podria decir que no me estaba
haciendo efecto la medicacion al mismo nivel que el vie/sab/dom, o sea
que no es lo mismo creo estar en la casa sin salir de la casa que
tener que enfrentar el mundo real y tener que hacer cosas. 
No se si la migraña se "preparo" el dia anterior, si influyo la
comida, la forma en que la comi, si fue la reunion prolongada con el
Fede, si fue la vuelta al centro, si fue todo eso, pero creo que
quizas haya que ajustar las dosis para estar mas relajado.

*** 2018-11-15 jueves
**** :retiro:ansiedad:problemaCami:
:LOGBOOK:
CLOCK: [2018-11-15 jue 11:14]--[2018-11-15 jue 11:19] =>  0:05
:END:
me arrepiento totalmente de haberme tomado el retiro.
Creo que podria haber seguido como pudiera resolviendo el problemaCami
y haber seguido con mi vida que era muchisimo mas libre que ahora, que
estoy prisionero de una situacion feisima pq mientras no vuelva me veo
obligado a trabajar sin descanso en algo que me gusta pero que no es
facil y requiere mucha dedicacion mucha mas que la que yo pensaba. O
sea que cai en una trampa hecha por mi mismo, y pone a prueba mis
nervios.
Pero en si viendolo desde el lado positivo, pone a prueba el sistema o
sea como carajo se podrian arreglar sin mi, o sea como carajo podrian
hacer andar una impresora que se traba, o un sistema que no saben
hacerlo andar. y que dos por tres estan cagandolo.
No esta mal que se hagan cargo de la situacion.
*** 2018-11-20 martes
**** fuerte migraña desarrollada y fuera de control aunque no fuerte :migraña:
:LOGBOOK:
CLOCK: [2018-11-20 mar 22:35]--[2018-11-20 mar 22:44] =>  0:09
:END:
hoy como quien no quiere la cosa termine tomando 2.5 migral y 2mg de
cortypiren.
Mas alla de los ansioliticos.
lo del dolor de cabeza es inexplicable, mas alla de que esta mañana
tenia hambre cuando estaba en la oficina, y solo me tome un cepita y
con esa "energia" solamente me fui a llevar los papeles de Fabian y
camine como 40 cuadras, lo cual no estoy acostumbrado y menos con este
calor, eso me produjo cierto nivel ya de aceleracion del dolor, y
lejos de relajarme, me puse a la maquina aunque no inmediatamente, y
creo que en vez de abusar de la maquina, abuse de la serie, y eso
exacerbo el dolor, y luego que habia tomado 1.5 separado decidir tomar
uno entero con el almuerzo y cansado del dolor que no era intenso ni
por asomo me tome el cuartito, y me fui a dormir, y relajar y me
relaje bien, me dormi rapido y se me fue rapido, o sea que la tonelada
de medicacion fue al pedo, o bien felizmente funciono, pero me hace
bosta en cierta forma.
Y luego de eso me tome una leche abundante y me puse  a maquina y ya
creo que sobrepase hace rato el punto del abuso y no me brindare cena
ni por asomo , parte pq no tengo nada de nada, y parte pq no tengo
ganas.
O sea mas de lo mismo.
Solo un yogurt lo unico que tengo.
Ni siquiera tengo para hacer cosas basicas como licuado, frutas, nada.
un asco.
Pero fue el primer dia de trabajo, y empezo con un pedo, que si bien
es cierto que no causo nerviosismo fue un garron, pq fue una caminata
garron grande.
Y bueno veremos que pasa mañana.
Vamos a ver que onda como se van planteando los dias subsiguientes
cuando me acostumbre a mi rutina.

En cuanto a la perdida de tiempo de hoy estuvo signada por gridplus,
que me hizo perder un pedo de tiempo, que estimo en mas de una hora,
casi dos.
Y creo que no me sirve, pq los arreglitos que necesitaba, como la
planilla extra o las otras guevaditas que hice hoy fueron rapidas. Y
asi deben ser.
*** 2018-11-21 miércoles
**** como organizar la jornada ahora :trabajo:problemaTiempo:
:LOGBOOK:
CLOCK: [2018-11-21 mié 12:00]--[2018-11-21 mié 12:05] =>  0:05
:END:
es pronto aun, pq llevo dos dias, al menos hoy no tuve que tomar nada
para ir a la oficina y ni siquiera tuve licuado, pq ayer tuve un tema
migrañoso semiproblematico.
cumplo la oficina normal, no encuentro problema ahi, y le puedo
asignar tareas a la Cami, de todos modos si la oficina fuera nuestra
solamente tendria que tener otra compu en red y tener otro sistema y
lo mismo no podria programar alla y estariamos en el mismo problema o
sea no se si estamos bien.
O sea ahora tengo para procesar las busquedas mejor, los planes de
pagos y demas, pero tengo el tema devoluciones que ahora voy a
intentar programar, y asi, seguiremos, veremos en que termina es un
pedo, pero no hay que ponerse nervioso, y tampoco hay que alterarse.
Creo que tengo que ir a la noche una horita o dos a pasar los
problemas, los planes y lo que haya alla. 
No caer en panico es una forma de ser no es un resultado.
** 2018-12 diciembre
*** 2018-12-04 martes
**** buscar la forma de hacer la tarea ahora :trabajo:problemaCami:
:LOGBOOK:
CLOCK: [2018-12-04 mar 09:41]--[2018-12-04 mar 09:45] =>  0:04
:END:
El problema es que se extiende la jornada de atencion de cobradores
con periodos inutiles de tiempo, aun imprimiendo aca, y eso que cuento
con medios imperfectos de determinacion de que zona imprimir, que si
pudiera marcar bien la zona que debo imprimir o imprimir mas
automaticamente o mas rapidamente, mejor.
O sea que el problema es el pasado de los recibos y las ventas y el
banco.
Ahora viene un periodo de depositos, en el cual tenemos que depositar
varios dias seguido y pagar boletas y en eso puede ser util la
Cami. Mas con el quilombo que va a ser el centro este mes, y yo
quedarme a pasar los papeles aca dentro.
**** avances y frustraciones :trabajo:programacion:
:LOGBOOK:
CLOCK: [2018-12-04 mar 17:43]--[2018-12-04 mar 17:56] =>  0:13
:END:
Estos ultimos dias he tenido unos grandes avances pero a veces
rescatando trabajo del pasado. Es increible lo logrado en el pasado y
como no se llego a documentar bien al menos ese esquema de trabajo o
bien a mejorarlo.
Y luego se fue abandonando hasta llegar a un nivel de cero total donde
no recordaba lo mas basico que seria que significaba [expr 2 +2] 
O sea ir a los extremos mas gigantes. Y asi no se puede pq en realidad
tardas un monton en llegar a donde ya estabas. Y te das cuenta que
estas dando vueltas en circulos.
O sea como que cuando estas trabajando te ocurre lo siguiente:
 1. te parece una perdida de tiempo documentar, menos documentar bien
 2. te parece perdida igual refactorizar o mejorar lo que esta hecho
 3. menos te parece mejorar las herramientas

 hasta que llega el colapso y uno se hastia y tira todo a la mierda y
 no programa mas y se va olvidando y deci que el sistema es estable
 que mas o menos sigue andando pq sino no se que seria. 
 
Ahora hay cosas fabulosas
1. crear un tbls con todo lo que tiene alrededor el tbls
2. crear un tree con una facilidad extrema incluso con un expandir
   personalizado ahora.
3. generar un pdf con un proc de detalle muy rapidamente para ensamblar
4. ya tenia el pivot que tambien se hacia muy facilmente
5. tenemos los combos con un filtro muy atomico no importa de donde
   vengan los datos
6. tengo un packer para rapido diseño de los packs mas complejos
7. tengo el menucontextual en los tbls recuperado hace poquito
*** 2018-12-05 miércoles
**** hoy pasar las planillas me produjo gran estres :estadoAnimico:clonazepan:
:LOGBOOK:
CLOCK: [2018-12-05 mié 16:46]--[2018-12-05 mié 16:59] =>  0:13
:END:
hoy empece como todas las mañanas de esta semana con 0.25 (media
blanca fuerte = una verde) mucho para el dia, y anduve bien, y luego
del mediodia cuando pensaba que podia reposar, fue pasando de a poco
el tiempo mientras pasaba mas las planillas me fue invadiendo el
nerviosismo hasta el punto de interrumpir y llamar a ih por telefono
mientras cocinaba. Ahi distendi un poco con pensamientos de corte de
venta, de comparativa con epocas pasadas, etc. 
Y luego comence a pasar papeles varios y se me empezo a endurecer la
panza y a poner nervioso el organismo y me tome la otra mitad.
y tengo de dia, dos clonazepan. lo cual pienso que es mucho pq antes
los tomaba para dormir.
Creo que me los causa la incobrabilidad. El pensamiento de que es muy
alta que es muy mucha la cagada y que podemos tener un nivel de
incobrabilidad que nos va a hacer perder plata.

Porque en otros momentos el nerviosismo se debia a otros factores, o
bien se debia a problemas con las personas, ya sean clientes, o
empleados pq habia una confrontacion pendiente, o una falla pendiente,
ya sea que alguien no se haya presentado, o habia que echar a alguien,
etc. pero no es el caso.
O bien cuando el nerviosismo se debia pq no tenia la gente suficiente
para cubrir las zonas y me parecia que no llegaban o que las zonas
estaban subhechas porque habia poca gente, pero ahora hay gente e
incluso hay postulantes llamables. Y no estoy en epoca de avisos que
me causen desasosiego.
O el desasosiego que me causaba el ambiente judicial o sea cuando
estan llegando cartas documento o demandas o cosas asi, esto es
diferente, o sea es un nerviosismo que nace pq el plan no funciona, o
sea pq vas viendo que hay una incobrabilidad generalizada que excede
lo normal.
